/* automatically generated by rust-bindgen */

pub const TCL_ALPHA_RELEASE: u32 = 0;
pub const TCL_BETA_RELEASE: u32 = 1;
pub const TCL_FINAL_RELEASE: u32 = 2;
pub const TCL_MAJOR_VERSION: u32 = 8;
pub const TCL_MINOR_VERSION: u32 = 6;
pub const TCL_RELEASE_LEVEL: u32 = 2;
pub const TCL_RELEASE_SERIAL: u32 = 8;
pub const TCL_VERSION: &'static [u8; 4usize] = b"8.6\0";
pub const TCL_PATCH_LEVEL: &'static [u8; 6usize] = b"8.6.8\0";
pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __STDC_NO_THREADS__: u32 = 1;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 27;
pub const _SYS_CDEFS_H: u32 = 1;

pub const TCL_PARSE_MISSING_VAR_BRACE: u32 = 7;
pub const TCL_PARSE_SYNTAX: u32 = 8;
pub const TCL_PARSE_BAD_NUMBER: u32 = 9;
pub const NUM_STATIC_TOKENS: u32 = 20;
pub const TCL_ENCODING_START: u32 = 1;
pub const TCL_ENCODING_END: u32 = 2;
pub const TCL_ENCODING_STOPONERROR: u32 = 4;
pub const TCL_ENCODING_NO_TERMINATE: u32 = 8;
pub const TCL_ENCODING_CHAR_LIMIT: u32 = 16;
pub const TCL_CONVERT_MULTIBYTE: i32 = -1;
pub const TCL_CONVERT_SYNTAX: i32 = -2;
pub const TCL_CONVERT_UNKNOWN: i32 = -3;
pub const TCL_CONVERT_NOSPACE: i32 = -4;
pub const TCL_UTF_MAX: u32 = 3;
pub const TCL_LIMIT_COMMANDS: u32 = 1;
pub const TCL_LIMIT_TIME: u32 = 2;
pub const TCL_ARGV_CONSTANT: u32 = 15;
pub const TCL_ARGV_INT: u32 = 16;
pub const TCL_ARGV_STRING: u32 = 17;
pub const TCL_ARGV_REST: u32 = 18;
pub const TCL_ARGV_FLOAT: u32 = 19;
pub const TCL_ARGV_FUNC: u32 = 20;
pub const TCL_ARGV_GENFUNC: u32 = 21;
pub const TCL_ARGV_HELP: u32 = 22;
pub const TCL_ARGV_END: u32 = 23;
pub const TCL_ZLIB_FORMAT_RAW: u32 = 1;
pub const TCL_ZLIB_FORMAT_ZLIB: u32 = 2;
pub const TCL_ZLIB_FORMAT_GZIP: u32 = 4;
pub const TCL_ZLIB_FORMAT_AUTO: u32 = 8;
pub const TCL_ZLIB_STREAM_DEFLATE: u32 = 16;
pub const TCL_ZLIB_STREAM_INFLATE: u32 = 32;
pub const TCL_ZLIB_COMPRESS_NONE: u32 = 0;
pub const TCL_ZLIB_COMPRESS_FAST: u32 = 1;
pub const TCL_ZLIB_COMPRESS_BEST: u32 = 9;
pub const TCL_ZLIB_COMPRESS_DEFAULT: i32 = -1;
pub const TCL_ZLIB_NO_FLUSH: u32 = 0;
pub const TCL_ZLIB_FLUSH: u32 = 2;
pub const TCL_ZLIB_FULLFLUSH: u32 = 3;
pub const TCL_ZLIB_FINALIZE: u32 = 4;
pub const TCL_LOAD_GLOBAL: u32 = 1;
pub const TCL_LOAD_LAZY: u32 = 2;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_marker>()))._next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_marker>()))._pos as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _
                as usize
        },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize
        },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type __io_close_fn = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void)
        -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(
        arg1: *mut _IO_FILE,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(
        __c: ::std::os::raw::c_int,
        __fp: *mut _IO_FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(
        arg1: *mut _IO_FILE,
        arg2: ::std::os::raw::c_int,
        arg3: __ssize_t,
    ) -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(
        arg1: *mut _IO_FILE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    ) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "\u{1}stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "\u{1}stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "\u{1}stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(
        __filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(
        __s: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(
        __s: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(
        __fd: ::std::os::raw::c_int,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __size: usize,
    );
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(
        __c: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(
        __w: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(
        __s: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(
        __c: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __s: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(
        __stream: *mut FILE,
        __pos: *mut fpos_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(
        __stream: *mut FILE,
        __pos: *const fpos_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}sys_nerr"]
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}sys_errlist"]
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(
        __s: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type ClientData = *mut ::std::os::raw::c_void;
pub type Tcl_WideInt = ::std::os::raw::c_longlong;
pub type Tcl_WideUInt = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    _unused: [u8; 0],
}
pub type Tcl_StatBuf = stat;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Interp {
    pub resultDontUse: *mut ::std::os::raw::c_char,
    pub freeProcDontUse: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_char),
    >,
    pub errorLineDontUse: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Tcl_Interp() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Interp>(),
        24usize,
        concat!("Size of: ", stringify!(Tcl_Interp))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Interp>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Interp))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Interp>())).resultDontUse as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Interp),
            "::",
            stringify!(resultDontUse)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Interp>())).freeProcDontUse as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Interp),
            "::",
            stringify!(freeProcDontUse)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Interp>())).errorLineDontUse as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Interp),
            "::",
            stringify!(errorLineDontUse)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_AsyncHandler_ {
    _unused: [u8; 0],
}
pub type Tcl_AsyncHandler = *mut Tcl_AsyncHandler_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Channel_ {
    _unused: [u8; 0],
}
pub type Tcl_Channel = *mut Tcl_Channel_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_ChannelTypeVersion_ {
    _unused: [u8; 0],
}
pub type Tcl_ChannelTypeVersion = *mut Tcl_ChannelTypeVersion_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Command_ {
    _unused: [u8; 0],
}
pub type Tcl_Command = *mut Tcl_Command_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Condition_ {
    _unused: [u8; 0],
}
pub type Tcl_Condition = *mut Tcl_Condition_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Dict_ {
    _unused: [u8; 0],
}
pub type Tcl_Dict = *mut Tcl_Dict_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_EncodingState_ {
    _unused: [u8; 0],
}
pub type Tcl_EncodingState = *mut Tcl_EncodingState_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Encoding_ {
    _unused: [u8; 0],
}
pub type Tcl_Encoding = *mut Tcl_Encoding_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_InterpState_ {
    _unused: [u8; 0],
}
pub type Tcl_InterpState = *mut Tcl_InterpState_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_LoadHandle_ {
    _unused: [u8; 0],
}
pub type Tcl_LoadHandle = *mut Tcl_LoadHandle_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Mutex_ {
    _unused: [u8; 0],
}
pub type Tcl_Mutex = *mut Tcl_Mutex_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Pid_ {
    _unused: [u8; 0],
}
pub type Tcl_Pid = *mut Tcl_Pid_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_RegExp_ {
    _unused: [u8; 0],
}
pub type Tcl_RegExp = *mut Tcl_RegExp_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_ThreadDataKey_ {
    _unused: [u8; 0],
}
pub type Tcl_ThreadDataKey = *mut Tcl_ThreadDataKey_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_ThreadId_ {
    _unused: [u8; 0],
}
pub type Tcl_ThreadId = *mut Tcl_ThreadId_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_TimerToken_ {
    _unused: [u8; 0],
}
pub type Tcl_TimerToken = *mut Tcl_TimerToken_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Trace_ {
    _unused: [u8; 0],
}
pub type Tcl_Trace = *mut Tcl_Trace_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Var_ {
    _unused: [u8; 0],
}
pub type Tcl_Var = *mut Tcl_Var_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_ZLibStream_ {
    _unused: [u8; 0],
}
pub type Tcl_ZlibStream = *mut Tcl_ZLibStream_;
pub type Tcl_ThreadCreateProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_RegExpIndices {
    pub start: ::std::os::raw::c_long,
    pub end: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_Tcl_RegExpIndices() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_RegExpIndices>(),
        16usize,
        concat!("Size of: ", stringify!(Tcl_RegExpIndices))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_RegExpIndices>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_RegExpIndices))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_RegExpIndices>())).start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_RegExpIndices),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_RegExpIndices>())).end as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_RegExpIndices),
            "::",
            stringify!(end)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_RegExpInfo {
    pub nsubs: ::std::os::raw::c_int,
    pub matches: *mut Tcl_RegExpIndices,
    pub extendStart: ::std::os::raw::c_long,
    pub reserved: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_Tcl_RegExpInfo() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_RegExpInfo>(),
        32usize,
        concat!("Size of: ", stringify!(Tcl_RegExpInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_RegExpInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_RegExpInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_RegExpInfo>())).nsubs as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_RegExpInfo),
            "::",
            stringify!(nsubs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_RegExpInfo>())).matches as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_RegExpInfo),
            "::",
            stringify!(matches)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_RegExpInfo>())).extendStart as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_RegExpInfo),
            "::",
            stringify!(extendStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_RegExpInfo>())).reserved as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_RegExpInfo),
            "::",
            stringify!(reserved)
        )
    );
}
pub type Tcl_Stat_ = *mut Tcl_StatBuf;
pub type Tcl_OldStat_ = *mut stat;
pub const Tcl_ValueType_TCL_INT: Tcl_ValueType = 0;
pub const Tcl_ValueType_TCL_DOUBLE: Tcl_ValueType = 1;
pub const Tcl_ValueType_TCL_EITHER: Tcl_ValueType = 2;
pub const Tcl_ValueType_TCL_WIDE_INT: Tcl_ValueType = 3;
pub type Tcl_ValueType = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Value {
    pub type_: Tcl_ValueType,
    pub intValue: ::std::os::raw::c_long,
    pub doubleValue: f64,
    pub wideValue: Tcl_WideInt,
}
#[test]
fn bindgen_test_layout_Tcl_Value() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Value>(),
        32usize,
        concat!("Size of: ", stringify!(Tcl_Value))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Value>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Value))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Value>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Value),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Value>())).intValue as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Value),
            "::",
            stringify!(intValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Value>())).doubleValue as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Value),
            "::",
            stringify!(doubleValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Value>())).wideValue as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Value),
            "::",
            stringify!(wideValue)
        )
    );
}
pub type Tcl_AppInitProc = ::std::option::Option<
    unsafe extern "C" fn(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int,
>;
pub type Tcl_AsyncProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        code: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_ChannelProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData, mask: ::std::os::raw::c_int),
>;
pub type Tcl_CloseProc =
    ::std::option::Option<unsafe extern "C" fn(data: ClientData)>;
pub type Tcl_CmdDeleteProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_CmdProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        argc: ::std::os::raw::c_int,
        argv: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_CmdTraceProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        level: ::std::os::raw::c_int,
        command: *mut ::std::os::raw::c_char,
        proc_: Tcl_CmdProc,
        cmdClientData: ClientData,
        argc: ::std::os::raw::c_int,
        argv: *mut *const ::std::os::raw::c_char,
    ),
>;
pub type Tcl_CmdObjTraceProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        level: ::std::os::raw::c_int,
        command: *const ::std::os::raw::c_char,
        commandInfo: Tcl_Command,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_CmdObjTraceDeleteProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_DupInternalRepProc = ::std::option::Option<
    unsafe extern "C" fn(srcPtr: *mut Tcl_Obj, dupPtr: *mut Tcl_Obj),
>;
pub type Tcl_EncodingConvertProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        src: *const ::std::os::raw::c_char,
        srcLen: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        statePtr: *mut Tcl_EncodingState,
        dst: *mut ::std::os::raw::c_char,
        dstLen: ::std::os::raw::c_int,
        srcReadPtr: *mut ::std::os::raw::c_int,
        dstWrotePtr: *mut ::std::os::raw::c_int,
        dstCharsPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_EncodingFreeProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_EventProc = ::std::option::Option<
    unsafe extern "C" fn(evPtr: *mut Tcl_Event, flags: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_EventCheckProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData, flags: ::std::os::raw::c_int),
>;
pub type Tcl_EventDeleteProc = ::std::option::Option<
    unsafe extern "C" fn(evPtr: *mut Tcl_Event, clientData: ClientData)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_EventSetupProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData, flags: ::std::os::raw::c_int),
>;
pub type Tcl_ExitProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_FileProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData, mask: ::std::os::raw::c_int),
>;
pub type Tcl_FileFreeProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_FreeInternalRepProc =
    ::std::option::Option<unsafe extern "C" fn(objPtr: *mut Tcl_Obj)>;
pub type Tcl_FreeProc = ::std::option::Option<
    unsafe extern "C" fn(blockPtr: *mut ::std::os::raw::c_char),
>;
pub type Tcl_IdleProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_InterpDeleteProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData, interp: *mut Tcl_Interp),
>;
pub type Tcl_MathProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        args: *mut Tcl_Value,
        resultPtr: *mut Tcl_Value,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_NamespaceDeleteProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_ObjCmdProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_PackageInitProc = ::std::option::Option<
    unsafe extern "C" fn(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int,
>;
pub type Tcl_PackageUnloadProc = ::std::option::Option<
    unsafe extern "C" fn(interp: *mut Tcl_Interp, flags: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_PanicProc = ::std::option::Option<
    unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...),
>;
pub type Tcl_TcpAcceptProc = ::std::option::Option<
    unsafe extern "C" fn(
        callbackData: ClientData,
        chan: Tcl_Channel,
        address: *mut ::std::os::raw::c_char,
        port: ::std::os::raw::c_int,
    ),
>;
pub type Tcl_TimerProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_SetFromAnyProc = ::std::option::Option<
    unsafe extern "C" fn(interp: *mut Tcl_Interp, objPtr: *mut Tcl_Obj)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_UpdateStringProc =
    ::std::option::Option<unsafe extern "C" fn(objPtr: *mut Tcl_Obj)>;
pub type Tcl_VarTraceProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char,
>;
pub type Tcl_CommandTraceProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        oldName: *const ::std::os::raw::c_char,
        newName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ),
>;
pub type Tcl_CreateFileHandlerProc = ::std::option::Option<
    unsafe extern "C" fn(
        fd: ::std::os::raw::c_int,
        mask: ::std::os::raw::c_int,
        proc_: Tcl_FileProc,
        clientData: ClientData,
    ),
>;
pub type Tcl_DeleteFileHandlerProc =
    ::std::option::Option<unsafe extern "C" fn(fd: ::std::os::raw::c_int)>;
pub type Tcl_AlertNotifierProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_ServiceModeHookProc =
    ::std::option::Option<unsafe extern "C" fn(mode: ::std::os::raw::c_int)>;
pub type Tcl_InitNotifierProc =
    ::std::option::Option<unsafe extern "C" fn() -> ClientData>;
pub type Tcl_FinalizeNotifierProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_MainLoopProc = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_ObjType {
    pub name: *const ::std::os::raw::c_char,
    pub freeIntRepProc: Tcl_FreeInternalRepProc,
    pub dupIntRepProc: Tcl_DupInternalRepProc,
    pub updateStringProc: Tcl_UpdateStringProc,
    pub setFromAnyProc: Tcl_SetFromAnyProc,
}
#[test]
fn bindgen_test_layout_Tcl_ObjType() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_ObjType>(),
        40usize,
        concat!("Size of: ", stringify!(Tcl_ObjType))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_ObjType>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_ObjType))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ObjType>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ObjType),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ObjType>())).freeIntRepProc as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ObjType),
            "::",
            stringify!(freeIntRepProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ObjType>())).dupIntRepProc as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ObjType),
            "::",
            stringify!(dupIntRepProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ObjType>())).updateStringProc as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ObjType),
            "::",
            stringify!(updateStringProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ObjType>())).setFromAnyProc as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ObjType),
            "::",
            stringify!(setFromAnyProc)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Tcl_Obj {
    pub refCount: ::std::os::raw::c_int,
    pub bytes: *mut ::std::os::raw::c_char,
    pub length: ::std::os::raw::c_int,
    pub typePtr: *const Tcl_ObjType,
    pub internalRep: Tcl_Obj__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Tcl_Obj__bindgen_ty_1 {
    pub longValue: ::std::os::raw::c_long,
    pub doubleValue: f64,
    pub otherValuePtr: *mut ::std::os::raw::c_void,
    pub wideValue: Tcl_WideInt,
    pub twoPtrValue: Tcl_Obj__bindgen_ty_1__bindgen_ty_1,
    pub ptrAndLongRep: Tcl_Obj__bindgen_ty_1__bindgen_ty_2,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Obj__bindgen_ty_1__bindgen_ty_1 {
    pub ptr1: *mut ::std::os::raw::c_void,
    pub ptr2: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Tcl_Obj__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Obj__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Obj__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1__bindgen_ty_1>())).ptr1
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1__bindgen_ty_1>())).ptr2
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Obj__bindgen_ty_1__bindgen_ty_2 {
    pub ptr: *mut ::std::os::raw::c_void,
    pub value: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_Tcl_Obj__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Obj__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Obj__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1__bindgen_ty_2>())).ptr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1__bindgen_ty_2>()))
                .value as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout_Tcl_Obj__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Obj__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(Tcl_Obj__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Obj__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Obj__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1>())).longValue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1),
            "::",
            stringify!(longValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1>())).doubleValue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1),
            "::",
            stringify!(doubleValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1>())).otherValuePtr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1),
            "::",
            stringify!(otherValuePtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1>())).wideValue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1),
            "::",
            stringify!(wideValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1>())).twoPtrValue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1),
            "::",
            stringify!(twoPtrValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj__bindgen_ty_1>())).ptrAndLongRep
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj__bindgen_ty_1),
            "::",
            stringify!(ptrAndLongRep)
        )
    );
}
#[test]
fn bindgen_test_layout_Tcl_Obj() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Obj>(),
        48usize,
        concat!("Size of: ", stringify!(Tcl_Obj))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Obj>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Obj))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj>())).refCount as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj),
            "::",
            stringify!(refCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj>())).bytes as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj>())).length as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj>())).typePtr as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj),
            "::",
            stringify!(typePtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Obj>())).internalRep as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Obj),
            "::",
            stringify!(internalRep)
        )
    );
}
extern "C" {
    pub fn Tcl_IncrRefCount(objPtr: *mut Tcl_Obj);
}
extern "C" {
    pub fn Tcl_DecrRefCount(objPtr: *mut Tcl_Obj);
}
extern "C" {
    pub fn Tcl_IsShared(objPtr: *mut Tcl_Obj) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Tcl_SavedResult {
    pub result: *mut ::std::os::raw::c_char,
    pub freeProc: Tcl_FreeProc,
    pub objResultPtr: *mut Tcl_Obj,
    pub appendResult: *mut ::std::os::raw::c_char,
    pub appendAvl: ::std::os::raw::c_int,
    pub appendUsed: ::std::os::raw::c_int,
    pub resultSpace: [::std::os::raw::c_char; 201usize],
}
#[test]
fn bindgen_test_layout_Tcl_SavedResult() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_SavedResult>(),
        248usize,
        concat!("Size of: ", stringify!(Tcl_SavedResult))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_SavedResult>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_SavedResult))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_SavedResult>())).result as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_SavedResult),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_SavedResult>())).freeProc as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_SavedResult),
            "::",
            stringify!(freeProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_SavedResult>())).objResultPtr as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_SavedResult),
            "::",
            stringify!(objResultPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_SavedResult>())).appendResult as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_SavedResult),
            "::",
            stringify!(appendResult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_SavedResult>())).appendAvl as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_SavedResult),
            "::",
            stringify!(appendAvl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_SavedResult>())).appendUsed as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_SavedResult),
            "::",
            stringify!(appendUsed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_SavedResult>())).resultSpace as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_SavedResult),
            "::",
            stringify!(resultSpace)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Namespace {
    pub name: *mut ::std::os::raw::c_char,
    pub fullName: *mut ::std::os::raw::c_char,
    pub clientData: ClientData,
    pub deleteProc: Tcl_NamespaceDeleteProc,
    pub parentPtr: *mut Tcl_Namespace,
}
#[test]
fn bindgen_test_layout_Tcl_Namespace() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Namespace>(),
        40usize,
        concat!("Size of: ", stringify!(Tcl_Namespace))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Namespace>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Namespace))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Namespace>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Namespace),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Namespace>())).fullName as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Namespace),
            "::",
            stringify!(fullName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Namespace>())).clientData as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Namespace),
            "::",
            stringify!(clientData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Namespace>())).deleteProc as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Namespace),
            "::",
            stringify!(deleteProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Namespace>())).parentPtr as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Namespace),
            "::",
            stringify!(parentPtr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_CallFrame {
    pub nsPtr: *mut Tcl_Namespace,
    pub dummy1: ::std::os::raw::c_int,
    pub dummy2: ::std::os::raw::c_int,
    pub dummy3: *mut ::std::os::raw::c_void,
    pub dummy4: *mut ::std::os::raw::c_void,
    pub dummy5: *mut ::std::os::raw::c_void,
    pub dummy6: ::std::os::raw::c_int,
    pub dummy7: *mut ::std::os::raw::c_void,
    pub dummy8: *mut ::std::os::raw::c_void,
    pub dummy9: ::std::os::raw::c_int,
    pub dummy10: *mut ::std::os::raw::c_void,
    pub dummy11: *mut ::std::os::raw::c_void,
    pub dummy12: *mut ::std::os::raw::c_void,
    pub dummy13: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Tcl_CallFrame() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_CallFrame>(),
        104usize,
        concat!("Size of: ", stringify!(Tcl_CallFrame))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_CallFrame>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_CallFrame))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).nsPtr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(nsPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy1 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy2 as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy3 as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy4 as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy5 as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy6 as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy6)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy7 as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy7)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy8 as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy9 as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy9)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy10 as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy10)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy11 as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy11)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy12 as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy12)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CallFrame>())).dummy13 as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CallFrame),
            "::",
            stringify!(dummy13)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_CmdInfo {
    pub isNativeObjectProc: ::std::os::raw::c_int,
    pub objProc: Tcl_ObjCmdProc,
    pub objClientData: ClientData,
    pub proc_: Tcl_CmdProc,
    pub clientData: ClientData,
    pub deleteProc: Tcl_CmdDeleteProc,
    pub deleteData: ClientData,
    pub namespacePtr: *mut Tcl_Namespace,
}
#[test]
fn bindgen_test_layout_Tcl_CmdInfo() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_CmdInfo>(),
        64usize,
        concat!("Size of: ", stringify!(Tcl_CmdInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_CmdInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_CmdInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).isNativeObjectProc
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(isNativeObjectProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).objProc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(objProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).objClientData as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(objClientData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).proc_ as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(proc_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).clientData as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(clientData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).deleteProc as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(deleteProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).deleteData as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(deleteData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_CmdInfo>())).namespacePtr as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_CmdInfo),
            "::",
            stringify!(namespacePtr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Tcl_DString {
    pub string: *mut ::std::os::raw::c_char,
    pub length: ::std::os::raw::c_int,
    pub spaceAvl: ::std::os::raw::c_int,
    pub staticSpace: [::std::os::raw::c_char; 200usize],
}
#[test]
fn bindgen_test_layout_Tcl_DString() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_DString>(),
        216usize,
        concat!("Size of: ", stringify!(Tcl_DString))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_DString>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_DString))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_DString>())).string as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_DString),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_DString>())).length as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_DString),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_DString>())).spaceAvl as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_DString),
            "::",
            stringify!(spaceAvl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_DString>())).staticSpace as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_DString),
            "::",
            stringify!(staticSpace)
        )
    );
}
pub type Tcl_HashKeyProc = ::std::option::Option<
    unsafe extern "C" fn(
        tablePtr: *mut Tcl_HashTable,
        keyPtr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint,
>;
pub type Tcl_CompareHashKeysProc = ::std::option::Option<
    unsafe extern "C" fn(
        keyPtr: *mut ::std::os::raw::c_void,
        hPtr: *mut Tcl_HashEntry,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_AllocHashEntryProc = ::std::option::Option<
    unsafe extern "C" fn(
        tablePtr: *mut Tcl_HashTable,
        keyPtr: *mut ::std::os::raw::c_void,
    ) -> *mut Tcl_HashEntry,
>;
pub type Tcl_FreeHashEntryProc =
    ::std::option::Option<unsafe extern "C" fn(hPtr: *mut Tcl_HashEntry)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Tcl_HashEntry {
    pub nextPtr: *mut Tcl_HashEntry,
    pub tablePtr: *mut Tcl_HashTable,
    pub hash: *mut ::std::os::raw::c_void,
    pub clientData: ClientData,
    pub key: Tcl_HashEntry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Tcl_HashEntry__bindgen_ty_1 {
    pub oneWordValue: *mut ::std::os::raw::c_char,
    pub objPtr: *mut Tcl_Obj,
    pub words: [::std::os::raw::c_int; 1usize],
    pub string: [::std::os::raw::c_char; 1usize],
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_Tcl_HashEntry__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_HashEntry__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Tcl_HashEntry__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_HashEntry__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_HashEntry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry__bindgen_ty_1>())).oneWordValue
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry__bindgen_ty_1),
            "::",
            stringify!(oneWordValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry__bindgen_ty_1>())).objPtr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry__bindgen_ty_1),
            "::",
            stringify!(objPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry__bindgen_ty_1>())).words
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry__bindgen_ty_1),
            "::",
            stringify!(words)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry__bindgen_ty_1>())).string
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry__bindgen_ty_1),
            "::",
            stringify!(string)
        )
    );
}
#[test]
fn bindgen_test_layout_Tcl_HashEntry() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_HashEntry>(),
        40usize,
        concat!("Size of: ", stringify!(Tcl_HashEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_HashEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_HashEntry))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry>())).nextPtr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry),
            "::",
            stringify!(nextPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry>())).tablePtr as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry),
            "::",
            stringify!(tablePtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry>())).hash as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry>())).clientData as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry),
            "::",
            stringify!(clientData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashEntry>())).key as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashEntry),
            "::",
            stringify!(key)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_HashKeyType {
    pub version: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
    pub hashKeyProc: Tcl_HashKeyProc,
    pub compareKeysProc: Tcl_CompareHashKeysProc,
    pub allocEntryProc: Tcl_AllocHashEntryProc,
    pub freeEntryProc: Tcl_FreeHashEntryProc,
}
#[test]
fn bindgen_test_layout_Tcl_HashKeyType() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_HashKeyType>(),
        40usize,
        concat!("Size of: ", stringify!(Tcl_HashKeyType))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_HashKeyType>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_HashKeyType))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashKeyType>())).version as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashKeyType),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashKeyType>())).flags as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashKeyType),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashKeyType>())).hashKeyProc as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashKeyType),
            "::",
            stringify!(hashKeyProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashKeyType>())).compareKeysProc
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashKeyType),
            "::",
            stringify!(compareKeysProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashKeyType>())).allocEntryProc
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashKeyType),
            "::",
            stringify!(allocEntryProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashKeyType>())).freeEntryProc
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashKeyType),
            "::",
            stringify!(freeEntryProc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_HashTable {
    pub buckets: *mut *mut Tcl_HashEntry,
    pub staticBuckets: [*mut Tcl_HashEntry; 4usize],
    pub numBuckets: ::std::os::raw::c_int,
    pub numEntries: ::std::os::raw::c_int,
    pub rebuildSize: ::std::os::raw::c_int,
    pub downShift: ::std::os::raw::c_int,
    pub mask: ::std::os::raw::c_int,
    pub keyType: ::std::os::raw::c_int,
    pub findProc: ::std::option::Option<
        unsafe extern "C" fn(
            tablePtr: *mut Tcl_HashTable,
            key: *const ::std::os::raw::c_char,
        ) -> *mut Tcl_HashEntry,
    >,
    pub createProc: ::std::option::Option<
        unsafe extern "C" fn(
            tablePtr: *mut Tcl_HashTable,
            key: *const ::std::os::raw::c_char,
            newPtr: *mut ::std::os::raw::c_int,
        ) -> *mut Tcl_HashEntry,
    >,
    pub typePtr: *const Tcl_HashKeyType,
}
#[test]
fn bindgen_test_layout_Tcl_HashTable() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_HashTable>(),
        88usize,
        concat!("Size of: ", stringify!(Tcl_HashTable))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_HashTable>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_HashTable))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).buckets as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(buckets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).staticBuckets as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(staticBuckets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).numBuckets as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(numBuckets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).numEntries as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(numEntries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).rebuildSize as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(rebuildSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).downShift as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(downShift)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).mask as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).keyType as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(keyType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).findProc as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(findProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).createProc as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(createProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashTable>())).typePtr as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashTable),
            "::",
            stringify!(typePtr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_HashSearch {
    pub tablePtr: *mut Tcl_HashTable,
    pub nextIndex: ::std::os::raw::c_int,
    pub nextEntryPtr: *mut Tcl_HashEntry,
}
#[test]
fn bindgen_test_layout_Tcl_HashSearch() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_HashSearch>(),
        24usize,
        concat!("Size of: ", stringify!(Tcl_HashSearch))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_HashSearch>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_HashSearch))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashSearch>())).tablePtr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashSearch),
            "::",
            stringify!(tablePtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashSearch>())).nextIndex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashSearch),
            "::",
            stringify!(nextIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_HashSearch>())).nextEntryPtr as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_HashSearch),
            "::",
            stringify!(nextEntryPtr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_DictSearch {
    pub next: *mut ::std::os::raw::c_void,
    pub epoch: ::std::os::raw::c_int,
    pub dictionaryPtr: Tcl_Dict,
}
#[test]
fn bindgen_test_layout_Tcl_DictSearch() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_DictSearch>(),
        24usize,
        concat!("Size of: ", stringify!(Tcl_DictSearch))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_DictSearch>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_DictSearch))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_DictSearch>())).next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_DictSearch),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_DictSearch>())).epoch as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_DictSearch),
            "::",
            stringify!(epoch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_DictSearch>())).dictionaryPtr as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_DictSearch),
            "::",
            stringify!(dictionaryPtr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Event {
    pub proc_: Tcl_EventProc,
    pub nextPtr: *mut Tcl_Event,
}
#[test]
fn bindgen_test_layout_Tcl_Event() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Event>(),
        16usize,
        concat!("Size of: ", stringify!(Tcl_Event))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Event>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Event))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Event>())).proc_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Event),
            "::",
            stringify!(proc_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Event>())).nextPtr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Event),
            "::",
            stringify!(nextPtr)
        )
    );
}
pub const Tcl_QueuePosition_TCL_QUEUE_TAIL: Tcl_QueuePosition = 0;
pub const Tcl_QueuePosition_TCL_QUEUE_HEAD: Tcl_QueuePosition = 1;
pub const Tcl_QueuePosition_TCL_QUEUE_MARK: Tcl_QueuePosition = 2;
pub type Tcl_QueuePosition = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Time {
    pub sec: ::std::os::raw::c_long,
    pub usec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_Tcl_Time() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Time>(),
        16usize,
        concat!("Size of: ", stringify!(Tcl_Time))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Time>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Time))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Time>())).sec as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Time),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Time>())).usec as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Time),
            "::",
            stringify!(usec)
        )
    );
}
pub type Tcl_SetTimerProc =
    ::std::option::Option<unsafe extern "C" fn(timePtr: *const Tcl_Time)>;
pub type Tcl_WaitForEventProc = ::std::option::Option<
    unsafe extern "C" fn(timePtr: *const Tcl_Time) -> ::std::os::raw::c_int,
>;
pub type Tcl_GetTimeProc = ::std::option::Option<
    unsafe extern "C" fn(timebuf: *mut Tcl_Time, clientData: ClientData),
>;
pub type Tcl_ScaleTimeProc = ::std::option::Option<
    unsafe extern "C" fn(timebuf: *mut Tcl_Time, clientData: ClientData),
>;
pub type Tcl_DriverBlockModeProc = ::std::option::Option<
    unsafe extern "C" fn(instanceData: ClientData, mode: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverCloseProc = ::std::option::Option<
    unsafe extern "C" fn(instanceData: ClientData, interp: *mut Tcl_Interp)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverClose2Proc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        interp: *mut Tcl_Interp,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverInputProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        buf: *mut ::std::os::raw::c_char,
        toRead: ::std::os::raw::c_int,
        errorCodePtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverOutputProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        buf: *const ::std::os::raw::c_char,
        toWrite: ::std::os::raw::c_int,
        errorCodePtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverSeekProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        offset: ::std::os::raw::c_long,
        mode: ::std::os::raw::c_int,
        errorCodePtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverSetOptionProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        interp: *mut Tcl_Interp,
        optionName: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverGetOptionProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        interp: *mut Tcl_Interp,
        optionName: *const ::std::os::raw::c_char,
        dsPtr: *mut Tcl_DString,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverWatchProc = ::std::option::Option<
    unsafe extern "C" fn(instanceData: ClientData, mask: ::std::os::raw::c_int),
>;
pub type Tcl_DriverGetHandleProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        direction: ::std::os::raw::c_int,
        handlePtr: *mut ClientData,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverFlushProc = ::std::option::Option<
    unsafe extern "C" fn(instanceData: ClientData) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverHandlerProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        interestMask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_DriverWideSeekProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        offset: Tcl_WideInt,
        mode: ::std::os::raw::c_int,
        errorCodePtr: *mut ::std::os::raw::c_int,
    ) -> Tcl_WideInt,
>;
pub type Tcl_DriverThreadActionProc = ::std::option::Option<
    unsafe extern "C" fn(
        instanceData: ClientData,
        action: ::std::os::raw::c_int,
    ),
>;
pub type Tcl_DriverTruncateProc = ::std::option::Option<
    unsafe extern "C" fn(instanceData: ClientData, length: Tcl_WideInt)
        -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_ChannelType {
    pub typeName: *const ::std::os::raw::c_char,
    pub version: Tcl_ChannelTypeVersion,
    pub closeProc: Tcl_DriverCloseProc,
    pub inputProc: Tcl_DriverInputProc,
    pub outputProc: Tcl_DriverOutputProc,
    pub seekProc: Tcl_DriverSeekProc,
    pub setOptionProc: Tcl_DriverSetOptionProc,
    pub getOptionProc: Tcl_DriverGetOptionProc,
    pub watchProc: Tcl_DriverWatchProc,
    pub getHandleProc: Tcl_DriverGetHandleProc,
    pub close2Proc: Tcl_DriverClose2Proc,
    pub blockModeProc: Tcl_DriverBlockModeProc,
    pub flushProc: Tcl_DriverFlushProc,
    pub handlerProc: Tcl_DriverHandlerProc,
    pub wideSeekProc: Tcl_DriverWideSeekProc,
    pub threadActionProc: Tcl_DriverThreadActionProc,
    pub truncateProc: Tcl_DriverTruncateProc,
}
#[test]
fn bindgen_test_layout_Tcl_ChannelType() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_ChannelType>(),
        136usize,
        concat!("Size of: ", stringify!(Tcl_ChannelType))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_ChannelType>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_ChannelType))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).typeName as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(typeName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).version as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).closeProc as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(closeProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).inputProc as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(inputProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).outputProc as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(outputProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).seekProc as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(seekProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).setOptionProc
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(setOptionProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).getOptionProc
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(getOptionProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).watchProc as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(watchProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).getHandleProc
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(getHandleProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).close2Proc as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(close2Proc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).blockModeProc
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(blockModeProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).flushProc as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(flushProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).handlerProc as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(handlerProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).wideSeekProc as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(wideSeekProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).threadActionProc
                as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(threadActionProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ChannelType>())).truncateProc as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ChannelType),
            "::",
            stringify!(truncateProc)
        )
    );
}
pub const Tcl_PathType_TCL_PATH_ABSOLUTE: Tcl_PathType = 0;
pub const Tcl_PathType_TCL_PATH_RELATIVE: Tcl_PathType = 1;
pub const Tcl_PathType_TCL_PATH_VOLUME_RELATIVE: Tcl_PathType = 2;
pub type Tcl_PathType = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_GlobTypeData {
    pub type_: ::std::os::raw::c_int,
    pub perm: ::std::os::raw::c_int,
    pub macType: *mut Tcl_Obj,
    pub macCreator: *mut Tcl_Obj,
}
#[test]
fn bindgen_test_layout_Tcl_GlobTypeData() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_GlobTypeData>(),
        24usize,
        concat!("Size of: ", stringify!(Tcl_GlobTypeData))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_GlobTypeData>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_GlobTypeData))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_GlobTypeData>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_GlobTypeData),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_GlobTypeData>())).perm as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_GlobTypeData),
            "::",
            stringify!(perm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_GlobTypeData>())).macType as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_GlobTypeData),
            "::",
            stringify!(macType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_GlobTypeData>())).macCreator as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_GlobTypeData),
            "::",
            stringify!(macCreator)
        )
    );
}
pub type Tcl_FSStatProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj, buf: *mut Tcl_StatBuf)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_FSAccessProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj, mode: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_FSOpenFileChannelProc = ::std::option::Option<
    unsafe extern "C" fn(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
        mode: ::std::os::raw::c_int,
        permissions: ::std::os::raw::c_int,
    ) -> Tcl_Channel,
>;
pub type Tcl_FSMatchInDirectoryProc = ::std::option::Option<
    unsafe extern "C" fn(
        interp: *mut Tcl_Interp,
        result: *mut Tcl_Obj,
        pathPtr: *mut Tcl_Obj,
        pattern: *const ::std::os::raw::c_char,
        types: *mut Tcl_GlobTypeData,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSGetCwdProc = ::std::option::Option<
    unsafe extern "C" fn(interp: *mut Tcl_Interp) -> *mut Tcl_Obj,
>;
pub type Tcl_FSChdirProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSLstatProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj, buf: *mut Tcl_StatBuf)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_FSCreateDirectoryProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSDeleteFileProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSCopyDirectoryProc = ::std::option::Option<
    unsafe extern "C" fn(
        srcPathPtr: *mut Tcl_Obj,
        destPathPtr: *mut Tcl_Obj,
        errorPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSCopyFileProc = ::std::option::Option<
    unsafe extern "C" fn(srcPathPtr: *mut Tcl_Obj, destPathPtr: *mut Tcl_Obj)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_FSRemoveDirectoryProc = ::std::option::Option<
    unsafe extern "C" fn(
        pathPtr: *mut Tcl_Obj,
        recursive: ::std::os::raw::c_int,
        errorPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSRenameFileProc = ::std::option::Option<
    unsafe extern "C" fn(srcPathPtr: *mut Tcl_Obj, destPathPtr: *mut Tcl_Obj)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_FSUnloadFileProc =
    ::std::option::Option<unsafe extern "C" fn(loadHandle: Tcl_LoadHandle)>;
pub type Tcl_FSListVolumesProc =
    ::std::option::Option<unsafe extern "C" fn() -> *mut Tcl_Obj>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct utimbuf {
    _unused: [u8; 0],
}
pub type Tcl_FSUtimeProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj, tval: *mut utimbuf)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_FSNormalizePathProc = ::std::option::Option<
    unsafe extern "C" fn(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
        nextCheckpoint: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSFileAttrsGetProc = ::std::option::Option<
    unsafe extern "C" fn(
        interp: *mut Tcl_Interp,
        index: ::std::os::raw::c_int,
        pathPtr: *mut Tcl_Obj,
        objPtrRef: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSFileAttrStringsProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj, objPtrRef: *mut *mut Tcl_Obj)
        -> *const *const ::std::os::raw::c_char,
>;
pub type Tcl_FSFileAttrsSetProc = ::std::option::Option<
    unsafe extern "C" fn(
        interp: *mut Tcl_Interp,
        index: ::std::os::raw::c_int,
        pathPtr: *mut Tcl_Obj,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSLinkProc = ::std::option::Option<
    unsafe extern "C" fn(
        pathPtr: *mut Tcl_Obj,
        toPtr: *mut Tcl_Obj,
        linkType: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj,
>;
pub type Tcl_FSLoadFileProc = ::std::option::Option<
    unsafe extern "C" fn(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
        handlePtr: *mut Tcl_LoadHandle,
        unloadProcPtr: *mut Tcl_FSUnloadFileProc,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_FSPathInFilesystemProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj, clientDataPtr: *mut ClientData)
        -> ::std::os::raw::c_int,
>;
pub type Tcl_FSFilesystemPathTypeProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj) -> *mut Tcl_Obj,
>;
pub type Tcl_FSFilesystemSeparatorProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj) -> *mut Tcl_Obj,
>;
pub type Tcl_FSFreeInternalRepProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
pub type Tcl_FSDupInternalRepProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData) -> ClientData,
>;
pub type Tcl_FSInternalToNormalizedProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData) -> *mut Tcl_Obj,
>;
pub type Tcl_FSCreateInternalRepProc = ::std::option::Option<
    unsafe extern "C" fn(pathPtr: *mut Tcl_Obj) -> ClientData,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_FSVersion_ {
    _unused: [u8; 0],
}
pub type Tcl_FSVersion = *mut Tcl_FSVersion_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Filesystem {
    pub typeName: *const ::std::os::raw::c_char,
    pub structureLength: ::std::os::raw::c_int,
    pub version: Tcl_FSVersion,
    pub pathInFilesystemProc: Tcl_FSPathInFilesystemProc,
    pub dupInternalRepProc: Tcl_FSDupInternalRepProc,
    pub freeInternalRepProc: Tcl_FSFreeInternalRepProc,
    pub internalToNormalizedProc: Tcl_FSInternalToNormalizedProc,
    pub createInternalRepProc: Tcl_FSCreateInternalRepProc,
    pub normalizePathProc: Tcl_FSNormalizePathProc,
    pub filesystemPathTypeProc: Tcl_FSFilesystemPathTypeProc,
    pub filesystemSeparatorProc: Tcl_FSFilesystemSeparatorProc,
    pub statProc: Tcl_FSStatProc,
    pub accessProc: Tcl_FSAccessProc,
    pub openFileChannelProc: Tcl_FSOpenFileChannelProc,
    pub matchInDirectoryProc: Tcl_FSMatchInDirectoryProc,
    pub utimeProc: Tcl_FSUtimeProc,
    pub linkProc: Tcl_FSLinkProc,
    pub listVolumesProc: Tcl_FSListVolumesProc,
    pub fileAttrStringsProc: Tcl_FSFileAttrStringsProc,
    pub fileAttrsGetProc: Tcl_FSFileAttrsGetProc,
    pub fileAttrsSetProc: Tcl_FSFileAttrsSetProc,
    pub createDirectoryProc: Tcl_FSCreateDirectoryProc,
    pub removeDirectoryProc: Tcl_FSRemoveDirectoryProc,
    pub deleteFileProc: Tcl_FSDeleteFileProc,
    pub copyFileProc: Tcl_FSCopyFileProc,
    pub renameFileProc: Tcl_FSRenameFileProc,
    pub copyDirectoryProc: Tcl_FSCopyDirectoryProc,
    pub lstatProc: Tcl_FSLstatProc,
    pub loadFileProc: Tcl_FSLoadFileProc,
    pub getCwdProc: Tcl_FSGetCwdProc,
    pub chdirProc: Tcl_FSChdirProc,
}
#[test]
fn bindgen_test_layout_Tcl_Filesystem() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Filesystem>(),
        248usize,
        concat!("Size of: ", stringify!(Tcl_Filesystem))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Filesystem>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Filesystem))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).typeName as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(typeName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).structureLength
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(structureLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).version as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).pathInFilesystemProc
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(pathInFilesystemProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).dupInternalRepProc
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(dupInternalRepProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).freeInternalRepProc
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(freeInternalRepProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).internalToNormalizedProc
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(internalToNormalizedProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).createInternalRepProc
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(createInternalRepProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).normalizePathProc
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(normalizePathProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).filesystemPathTypeProc
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(filesystemPathTypeProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).filesystemSeparatorProc
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(filesystemSeparatorProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).statProc as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(statProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).accessProc as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(accessProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).openFileChannelProc
                as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(openFileChannelProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).matchInDirectoryProc
                as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(matchInDirectoryProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).utimeProc as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(utimeProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).linkProc as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(linkProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).listVolumesProc
                as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(listVolumesProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).fileAttrStringsProc
                as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(fileAttrStringsProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).fileAttrsGetProc
                as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(fileAttrsGetProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).fileAttrsSetProc
                as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(fileAttrsSetProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).createDirectoryProc
                as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(createDirectoryProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).removeDirectoryProc
                as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(removeDirectoryProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).deleteFileProc
                as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(deleteFileProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).copyFileProc as *const _
                as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(copyFileProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).renameFileProc
                as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(renameFileProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).copyDirectoryProc
                as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(copyDirectoryProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).lstatProc as *const _
                as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(lstatProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).loadFileProc as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(loadFileProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).getCwdProc as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(getCwdProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Filesystem>())).chdirProc as *const _
                as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Filesystem),
            "::",
            stringify!(chdirProc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_NotifierProcs {
    pub setTimerProc: Tcl_SetTimerProc,
    pub waitForEventProc: Tcl_WaitForEventProc,
    pub createFileHandlerProc: Tcl_CreateFileHandlerProc,
    pub deleteFileHandlerProc: Tcl_DeleteFileHandlerProc,
    pub initNotifierProc: Tcl_InitNotifierProc,
    pub finalizeNotifierProc: Tcl_FinalizeNotifierProc,
    pub alertNotifierProc: Tcl_AlertNotifierProc,
    pub serviceModeHookProc: Tcl_ServiceModeHookProc,
}
#[test]
fn bindgen_test_layout_Tcl_NotifierProcs() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_NotifierProcs>(),
        64usize,
        concat!("Size of: ", stringify!(Tcl_NotifierProcs))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_NotifierProcs>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_NotifierProcs))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).setTimerProc
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(setTimerProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).waitForEventProc
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(waitForEventProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).createFileHandlerProc
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(createFileHandlerProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).deleteFileHandlerProc
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(deleteFileHandlerProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).initNotifierProc
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(initNotifierProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).finalizeNotifierProc
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(finalizeNotifierProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).alertNotifierProc
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(alertNotifierProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_NotifierProcs>())).serviceModeHookProc
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_NotifierProcs),
            "::",
            stringify!(serviceModeHookProc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Token {
    pub type_: ::std::os::raw::c_int,
    pub start: *const ::std::os::raw::c_char,
    pub size: ::std::os::raw::c_int,
    pub numComponents: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Tcl_Token() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Token>(),
        24usize,
        concat!("Size of: ", stringify!(Tcl_Token))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Token>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Token))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Token>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Token),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Token>())).start as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Token),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Token>())).size as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Token),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Token>())).numComponents as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Token),
            "::",
            stringify!(numComponents)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Parse {
    pub commentStart: *const ::std::os::raw::c_char,
    pub commentSize: ::std::os::raw::c_int,
    pub commandStart: *const ::std::os::raw::c_char,
    pub commandSize: ::std::os::raw::c_int,
    pub numWords: ::std::os::raw::c_int,
    pub tokenPtr: *mut Tcl_Token,
    pub numTokens: ::std::os::raw::c_int,
    pub tokensAvailable: ::std::os::raw::c_int,
    pub errorType: ::std::os::raw::c_int,
    pub string: *const ::std::os::raw::c_char,
    pub end: *const ::std::os::raw::c_char,
    pub interp: *mut Tcl_Interp,
    pub term: *const ::std::os::raw::c_char,
    pub incomplete: ::std::os::raw::c_int,
    pub staticTokens: [Tcl_Token; 20usize],
}
#[test]
fn bindgen_test_layout_Tcl_Parse() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Parse>(),
        576usize,
        concat!("Size of: ", stringify!(Tcl_Parse))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Parse>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Parse))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).commentStart as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(commentStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).commentSize as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(commentSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).commandStart as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(commandStart)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).commandSize as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(commandSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).numWords as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(numWords)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).tokenPtr as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(tokenPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).numTokens as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(numTokens)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).tokensAvailable as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(tokensAvailable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).errorType as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(errorType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).string as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).end as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).interp as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(interp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).term as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(term)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).incomplete as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(incomplete)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Parse>())).staticTokens as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Parse),
            "::",
            stringify!(staticTokens)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_EncodingType {
    pub encodingName: *const ::std::os::raw::c_char,
    pub toUtfProc: Tcl_EncodingConvertProc,
    pub fromUtfProc: Tcl_EncodingConvertProc,
    pub freeProc: Tcl_EncodingFreeProc,
    pub clientData: ClientData,
    pub nullSize: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_Tcl_EncodingType() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_EncodingType>(),
        48usize,
        concat!("Size of: ", stringify!(Tcl_EncodingType))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_EncodingType>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_EncodingType))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_EncodingType>())).encodingName
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_EncodingType),
            "::",
            stringify!(encodingName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_EncodingType>())).toUtfProc as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_EncodingType),
            "::",
            stringify!(toUtfProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_EncodingType>())).fromUtfProc as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_EncodingType),
            "::",
            stringify!(fromUtfProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_EncodingType>())).freeProc as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_EncodingType),
            "::",
            stringify!(freeProc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_EncodingType>())).clientData as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_EncodingType),
            "::",
            stringify!(clientData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_EncodingType>())).nullSize as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_EncodingType),
            "::",
            stringify!(nullSize)
        )
    );
}
pub type Tcl_UniChar = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_Config {
    pub key: *const ::std::os::raw::c_char,
    pub value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Tcl_Config() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_Config>(),
        16usize,
        concat!("Size of: ", stringify!(Tcl_Config))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_Config>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_Config))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Config>())).key as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Config),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_Config>())).value as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_Config),
            "::",
            stringify!(value)
        )
    );
}
pub type Tcl_LimitHandlerProc = ::std::option::Option<
    unsafe extern "C" fn(clientData: ClientData, interp: *mut Tcl_Interp),
>;
pub type Tcl_LimitHandlerDeleteProc =
    ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mp_int {
    _unused: [u8; 0],
}
pub type mp_digit = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tcl_ArgvInfo {
    pub type_: ::std::os::raw::c_int,
    pub keyStr: *const ::std::os::raw::c_char,
    pub srcPtr: *mut ::std::os::raw::c_void,
    pub dstPtr: *mut ::std::os::raw::c_void,
    pub helpStr: *const ::std::os::raw::c_char,
    pub clientData: ClientData,
}
#[test]
fn bindgen_test_layout_Tcl_ArgvInfo() {
    assert_eq!(
        ::std::mem::size_of::<Tcl_ArgvInfo>(),
        48usize,
        concat!("Size of: ", stringify!(Tcl_ArgvInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Tcl_ArgvInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(Tcl_ArgvInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ArgvInfo>())).type_ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ArgvInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ArgvInfo>())).keyStr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ArgvInfo),
            "::",
            stringify!(keyStr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ArgvInfo>())).srcPtr as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ArgvInfo),
            "::",
            stringify!(srcPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ArgvInfo>())).dstPtr as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ArgvInfo),
            "::",
            stringify!(dstPtr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ArgvInfo>())).helpStr as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ArgvInfo),
            "::",
            stringify!(helpStr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tcl_ArgvInfo>())).clientData as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tcl_ArgvInfo),
            "::",
            stringify!(clientData)
        )
    );
}
pub type Tcl_ArgvFuncProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        objPtr: *mut Tcl_Obj,
        dstPtr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_ArgvGenFuncProc = ::std::option::Option<
    unsafe extern "C" fn(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        dstPtr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type Tcl_NRPostProc = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ClientData,
        interp: *mut Tcl_Interp,
        result: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn Tcl_InitStubs(
        interp: *mut Tcl_Interp,
        version: *const ::std::os::raw::c_char,
        exact: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TclTomMathInitializeStubs(
        interp: *mut Tcl_Interp,
        version: *const ::std::os::raw::c_char,
        epoch: ::std::os::raw::c_int,
        revision: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_MainEx(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
        appInitProc: Tcl_AppInitProc,
        interp: *mut Tcl_Interp,
    );
}
extern "C" {
    pub fn Tcl_PkgInitStubsCheck(
        interp: *mut Tcl_Interp,
        version: *const ::std::os::raw::c_char,
        exact: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetMemoryInfo(dsPtr: *mut Tcl_DString);
}
extern "C" {
    pub fn Tcl_PkgProvideEx(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        version: *const ::std::os::raw::c_char,
        clientData: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_PkgRequireEx(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        version: *const ::std::os::raw::c_char,
        exact: ::std::os::raw::c_int,
        clientDataPtr: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_Panic(format: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn Tcl_Alloc(
        size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_Free(ptr: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn Tcl_Realloc(
        ptr: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_DbCkalloc(
        size: ::std::os::raw::c_uint,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_DbCkfree(
        ptr: *mut ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_DbCkrealloc(
        ptr: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_uint,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_CreateFileHandler(
        fd: ::std::os::raw::c_int,
        mask: ::std::os::raw::c_int,
        proc_: Tcl_FileProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_DeleteFileHandler(fd: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_SetTimer(timePtr: *const Tcl_Time);
}
extern "C" {
    pub fn Tcl_Sleep(ms: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_WaitForEvent(timePtr: *const Tcl_Time) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_AppendAllObjTypes(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_AppendStringsToObj(objPtr: *mut Tcl_Obj, ...);
}
extern "C" {
    pub fn Tcl_AppendToObj(
        objPtr: *mut Tcl_Obj,
        bytes: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_ConcatObj(
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_ConvertToType(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        typePtr: *const Tcl_ObjType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DbDecrRefCount(
        objPtr: *mut Tcl_Obj,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_DbIncrRefCount(
        objPtr: *mut Tcl_Obj,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_DbIsShared(
        objPtr: *mut Tcl_Obj,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DbNewBooleanObj(
        boolValue: ::std::os::raw::c_int,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewByteArrayObj(
        bytes: *const ::std::os::raw::c_uchar,
        length: ::std::os::raw::c_int,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewDoubleObj(
        doubleValue: f64,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewListObj(
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewLongObj(
        longValue: ::std::os::raw::c_long,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewObj(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewStringObj(
        bytes: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DuplicateObj(objPtr: *mut Tcl_Obj) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn TclFreeObj(objPtr: *mut Tcl_Obj);
}
extern "C" {
    pub fn Tcl_GetBoolean(
        interp: *mut Tcl_Interp,
        src: *const ::std::os::raw::c_char,
        boolPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetBooleanFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        boolPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetByteArrayFromObj(
        objPtr: *mut Tcl_Obj,
        lengthPtr: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn Tcl_GetDouble(
        interp: *mut Tcl_Interp,
        src: *const ::std::os::raw::c_char,
        doublePtr: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetDoubleFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        doublePtr: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetIndexFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        tablePtr: *const *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        indexPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetInt(
        interp: *mut Tcl_Interp,
        src: *const ::std::os::raw::c_char,
        intPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetIntFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        intPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetLongFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        longPtr: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetObjType(
        typeName: *const ::std::os::raw::c_char,
    ) -> *const Tcl_ObjType;
}
extern "C" {
    pub fn Tcl_GetStringFromObj(
        objPtr: *mut Tcl_Obj,
        lengthPtr: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_InvalidateStringRep(objPtr: *mut Tcl_Obj);
}
extern "C" {
    pub fn Tcl_ListObjAppendList(
        interp: *mut Tcl_Interp,
        listPtr: *mut Tcl_Obj,
        elemListPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ListObjAppendElement(
        interp: *mut Tcl_Interp,
        listPtr: *mut Tcl_Obj,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ListObjGetElements(
        interp: *mut Tcl_Interp,
        listPtr: *mut Tcl_Obj,
        objcPtr: *mut ::std::os::raw::c_int,
        objvPtr: *mut *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ListObjIndex(
        interp: *mut Tcl_Interp,
        listPtr: *mut Tcl_Obj,
        index: ::std::os::raw::c_int,
        objPtrPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ListObjLength(
        interp: *mut Tcl_Interp,
        listPtr: *mut Tcl_Obj,
        lengthPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ListObjReplace(
        interp: *mut Tcl_Interp,
        listPtr: *mut Tcl_Obj,
        first: ::std::os::raw::c_int,
        count: ::std::os::raw::c_int,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NewBooleanObj(boolValue: ::std::os::raw::c_int) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_NewByteArrayObj(
        bytes: *const ::std::os::raw::c_uchar,
        length: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_NewDoubleObj(doubleValue: f64) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_NewIntObj(intValue: ::std::os::raw::c_int) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_NewListObj(
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_NewLongObj(longValue: ::std::os::raw::c_long) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_NewObj() -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_NewStringObj(
        bytes: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_SetBooleanObj(
        objPtr: *mut Tcl_Obj,
        boolValue: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_SetByteArrayLength(
        objPtr: *mut Tcl_Obj,
        length: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn Tcl_SetByteArrayObj(
        objPtr: *mut Tcl_Obj,
        bytes: *const ::std::os::raw::c_uchar,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_SetDoubleObj(objPtr: *mut Tcl_Obj, doubleValue: f64);
}
extern "C" {
    pub fn Tcl_SetIntObj(objPtr: *mut Tcl_Obj, intValue: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_SetListObj(
        objPtr: *mut Tcl_Obj,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    );
}
extern "C" {
    pub fn Tcl_SetLongObj(
        objPtr: *mut Tcl_Obj,
        longValue: ::std::os::raw::c_long,
    );
}
extern "C" {
    pub fn Tcl_SetObjLength(
        objPtr: *mut Tcl_Obj,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_SetStringObj(
        objPtr: *mut Tcl_Obj,
        bytes: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_AddErrorInfo(
        interp: *mut Tcl_Interp,
        message: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_AddObjErrorInfo(
        interp: *mut Tcl_Interp,
        message: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_AllowExceptions(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_AppendElement(
        interp: *mut Tcl_Interp,
        element: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_AppendResult(interp: *mut Tcl_Interp, ...);
}
extern "C" {
    pub fn Tcl_AsyncCreate(
        proc_: Tcl_AsyncProc,
        clientData: ClientData,
    ) -> Tcl_AsyncHandler;
}
extern "C" {
    pub fn Tcl_AsyncDelete(async_: Tcl_AsyncHandler);
}
extern "C" {
    pub fn Tcl_AsyncInvoke(
        interp: *mut Tcl_Interp,
        code: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_AsyncMark(async_: Tcl_AsyncHandler);
}
extern "C" {
    pub fn Tcl_AsyncReady() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_BackgroundError(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_Backslash(
        src: *const ::std::os::raw::c_char,
        readPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_BadChannelOption(
        interp: *mut Tcl_Interp,
        optionName: *const ::std::os::raw::c_char,
        optionList: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CallWhenDeleted(
        interp: *mut Tcl_Interp,
        proc_: Tcl_InterpDeleteProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_CancelIdleCall(idleProc: Tcl_IdleProc, clientData: ClientData);
}
extern "C" {
    pub fn Tcl_Close(
        interp: *mut Tcl_Interp,
        chan: Tcl_Channel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CommandComplete(
        cmd: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Concat(
        argc: ::std::os::raw::c_int,
        argv: *const *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_ConvertElement(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ConvertCountedElement(
        src: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        dst: *mut ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CreateAlias(
        slave: *mut Tcl_Interp,
        slaveCmd: *const ::std::os::raw::c_char,
        target: *mut Tcl_Interp,
        targetCmd: *const ::std::os::raw::c_char,
        argc: ::std::os::raw::c_int,
        argv: *const *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CreateAliasObj(
        slave: *mut Tcl_Interp,
        slaveCmd: *const ::std::os::raw::c_char,
        target: *mut Tcl_Interp,
        targetCmd: *const ::std::os::raw::c_char,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CreateChannel(
        typePtr: *const Tcl_ChannelType,
        chanName: *const ::std::os::raw::c_char,
        instanceData: ClientData,
        mask: ::std::os::raw::c_int,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_CreateChannelHandler(
        chan: Tcl_Channel,
        mask: ::std::os::raw::c_int,
        proc_: Tcl_ChannelProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_CreateCloseHandler(
        chan: Tcl_Channel,
        proc_: Tcl_CloseProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_CreateCommand(
        interp: *mut Tcl_Interp,
        cmdName: *const ::std::os::raw::c_char,
        proc_: Tcl_CmdProc,
        clientData: ClientData,
        deleteProc: Tcl_CmdDeleteProc,
    ) -> Tcl_Command;
}
extern "C" {
    pub fn Tcl_CreateEventSource(
        setupProc: Tcl_EventSetupProc,
        checkProc: Tcl_EventCheckProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_CreateExitHandler(proc_: Tcl_ExitProc, clientData: ClientData);
}
extern "C" {
    pub fn Tcl_CreateInterp() -> *mut Tcl_Interp;
}
extern "C" {
    pub fn Tcl_CreateMathFunc(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        numArgs: ::std::os::raw::c_int,
        argTypes: *mut Tcl_ValueType,
        proc_: Tcl_MathProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_CreateObjCommand(
        interp: *mut Tcl_Interp,
        cmdName: *const ::std::os::raw::c_char,
        proc_: Tcl_ObjCmdProc,
        clientData: ClientData,
        deleteProc: Tcl_CmdDeleteProc,
    ) -> Tcl_Command;
}
extern "C" {
    pub fn Tcl_CreateSlave(
        interp: *mut Tcl_Interp,
        slaveName: *const ::std::os::raw::c_char,
        isSafe: ::std::os::raw::c_int,
    ) -> *mut Tcl_Interp;
}
extern "C" {
    pub fn Tcl_CreateTimerHandler(
        milliseconds: ::std::os::raw::c_int,
        proc_: Tcl_TimerProc,
        clientData: ClientData,
    ) -> Tcl_TimerToken;
}
extern "C" {
    pub fn Tcl_CreateTrace(
        interp: *mut Tcl_Interp,
        level: ::std::os::raw::c_int,
        proc_: Tcl_CmdTraceProc,
        clientData: ClientData,
    ) -> Tcl_Trace;
}
extern "C" {
    pub fn Tcl_DeleteAssocData(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_DeleteChannelHandler(
        chan: Tcl_Channel,
        proc_: Tcl_ChannelProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_DeleteCloseHandler(
        chan: Tcl_Channel,
        proc_: Tcl_CloseProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_DeleteCommand(
        interp: *mut Tcl_Interp,
        cmdName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DeleteCommandFromToken(
        interp: *mut Tcl_Interp,
        command: Tcl_Command,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DeleteEvents(proc_: Tcl_EventDeleteProc, clientData: ClientData);
}
extern "C" {
    pub fn Tcl_DeleteEventSource(
        setupProc: Tcl_EventSetupProc,
        checkProc: Tcl_EventCheckProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_DeleteExitHandler(proc_: Tcl_ExitProc, clientData: ClientData);
}
extern "C" {
    pub fn Tcl_DeleteHashEntry(entryPtr: *mut Tcl_HashEntry);
}
extern "C" {
    pub fn Tcl_DeleteHashTable(tablePtr: *mut Tcl_HashTable);
}
extern "C" {
    pub fn Tcl_DeleteInterp(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_DetachPids(numPids: ::std::os::raw::c_int, pidPtr: *mut Tcl_Pid);
}
extern "C" {
    pub fn Tcl_DeleteTimerHandler(token: Tcl_TimerToken);
}
extern "C" {
    pub fn Tcl_DeleteTrace(interp: *mut Tcl_Interp, trace: Tcl_Trace);
}
extern "C" {
    pub fn Tcl_DontCallWhenDeleted(
        interp: *mut Tcl_Interp,
        proc_: Tcl_InterpDeleteProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_DoOneEvent(
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DoWhenIdle(proc_: Tcl_IdleProc, clientData: ClientData);
}
extern "C" {
    pub fn Tcl_DStringAppend(
        dsPtr: *mut Tcl_DString,
        bytes: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_DStringAppendElement(
        dsPtr: *mut Tcl_DString,
        element: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_DStringEndSublist(dsPtr: *mut Tcl_DString);
}
extern "C" {
    pub fn Tcl_DStringFree(dsPtr: *mut Tcl_DString);
}
extern "C" {
    pub fn Tcl_DStringGetResult(
        interp: *mut Tcl_Interp,
        dsPtr: *mut Tcl_DString,
    );
}
extern "C" {
    pub fn Tcl_DStringInit(dsPtr: *mut Tcl_DString);
}
extern "C" {
    pub fn Tcl_DStringResult(interp: *mut Tcl_Interp, dsPtr: *mut Tcl_DString);
}
extern "C" {
    pub fn Tcl_DStringSetLength(
        dsPtr: *mut Tcl_DString,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_DStringStartSublist(dsPtr: *mut Tcl_DString);
}
extern "C" {
    pub fn Tcl_Eof(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ErrnoId() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_ErrnoMsg(
        err: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_Eval(
        interp: *mut Tcl_Interp,
        script: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_EvalFile(
        interp: *mut Tcl_Interp,
        fileName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_EvalObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_EventuallyFree(clientData: ClientData, freeProc: Tcl_FreeProc);
}
extern "C" {
    pub fn Tcl_Exit(status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_ExposeCommand(
        interp: *mut Tcl_Interp,
        hiddenCmdToken: *const ::std::os::raw::c_char,
        cmdName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprBoolean(
        interp: *mut Tcl_Interp,
        expr: *const ::std::os::raw::c_char,
        ptr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprBooleanObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        ptr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprDouble(
        interp: *mut Tcl_Interp,
        expr: *const ::std::os::raw::c_char,
        ptr: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprDoubleObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        ptr: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprLong(
        interp: *mut Tcl_Interp,
        expr: *const ::std::os::raw::c_char,
        ptr: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprLongObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        ptr: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        resultPtrPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExprString(
        interp: *mut Tcl_Interp,
        expr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Finalize();
}
extern "C" {
    pub fn Tcl_FindExecutable(argv0: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn Tcl_FirstHashEntry(
        tablePtr: *mut Tcl_HashTable,
        searchPtr: *mut Tcl_HashSearch,
    ) -> *mut Tcl_HashEntry;
}
extern "C" {
    pub fn Tcl_Flush(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FreeResult(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_GetAlias(
        interp: *mut Tcl_Interp,
        slaveCmd: *const ::std::os::raw::c_char,
        targetInterpPtr: *mut *mut Tcl_Interp,
        targetCmdPtr: *mut *const ::std::os::raw::c_char,
        argcPtr: *mut ::std::os::raw::c_int,
        argvPtr: *mut *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetAliasObj(
        interp: *mut Tcl_Interp,
        slaveCmd: *const ::std::os::raw::c_char,
        targetInterpPtr: *mut *mut Tcl_Interp,
        targetCmdPtr: *mut *const ::std::os::raw::c_char,
        objcPtr: *mut ::std::os::raw::c_int,
        objv: *mut *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetAssocData(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        procPtr: *mut Tcl_InterpDeleteProc,
    ) -> ClientData;
}
extern "C" {
    pub fn Tcl_GetChannel(
        interp: *mut Tcl_Interp,
        chanName: *const ::std::os::raw::c_char,
        modePtr: *mut ::std::os::raw::c_int,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_GetChannelBufferSize(chan: Tcl_Channel)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetChannelHandle(
        chan: Tcl_Channel,
        direction: ::std::os::raw::c_int,
        handlePtr: *mut ClientData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetChannelInstanceData(chan: Tcl_Channel) -> ClientData;
}
extern "C" {
    pub fn Tcl_GetChannelMode(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetChannelName(
        chan: Tcl_Channel,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetChannelOption(
        interp: *mut Tcl_Interp,
        chan: Tcl_Channel,
        optionName: *const ::std::os::raw::c_char,
        dsPtr: *mut Tcl_DString,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetChannelType(chan: Tcl_Channel) -> *const Tcl_ChannelType;
}
extern "C" {
    pub fn Tcl_GetCommandInfo(
        interp: *mut Tcl_Interp,
        cmdName: *const ::std::os::raw::c_char,
        infoPtr: *mut Tcl_CmdInfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetCommandName(
        interp: *mut Tcl_Interp,
        command: Tcl_Command,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetErrno() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetHostName() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetInterpPath(
        askInterp: *mut Tcl_Interp,
        slaveInterp: *mut Tcl_Interp,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetMaster(interp: *mut Tcl_Interp) -> *mut Tcl_Interp;
}
extern "C" {
    pub fn Tcl_GetNameOfExecutable() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetObjResult(interp: *mut Tcl_Interp) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_GetOpenFile(
        interp: *mut Tcl_Interp,
        chanID: *const ::std::os::raw::c_char,
        forWriting: ::std::os::raw::c_int,
        checkUsage: ::std::os::raw::c_int,
        filePtr: *mut ClientData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetPathType(path: *const ::std::os::raw::c_char)
        -> Tcl_PathType;
}
extern "C" {
    pub fn Tcl_Gets(
        chan: Tcl_Channel,
        dsPtr: *mut Tcl_DString,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetsObj(
        chan: Tcl_Channel,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetServiceMode() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetSlave(
        interp: *mut Tcl_Interp,
        slaveName: *const ::std::os::raw::c_char,
    ) -> *mut Tcl_Interp;
}
extern "C" {
    pub fn Tcl_GetStdChannel(type_: ::std::os::raw::c_int) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_GetStringResult(
        interp: *mut Tcl_Interp,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetVar2(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GlobalEval(
        interp: *mut Tcl_Interp,
        command: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GlobalEvalObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_HideCommand(
        interp: *mut Tcl_Interp,
        cmdName: *const ::std::os::raw::c_char,
        hiddenCmdToken: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Init(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_InitHashTable(
        tablePtr: *mut Tcl_HashTable,
        keyType: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_InputBlocked(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_InputBuffered(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_InterpDeleted(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_IsSafe(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_JoinPath(
        argc: ::std::os::raw::c_int,
        argv: *const *const ::std::os::raw::c_char,
        resultPtr: *mut Tcl_DString,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_LinkVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        addr: *mut ::std::os::raw::c_char,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_MakeFileChannel(
        handle: ClientData,
        mode: ::std::os::raw::c_int,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_MakeSafe(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_MakeTcpClientChannel(tcpSocket: ClientData) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_Merge(
        argc: ::std::os::raw::c_int,
        argv: *const *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_NextHashEntry(
        searchPtr: *mut Tcl_HashSearch,
    ) -> *mut Tcl_HashEntry;
}
extern "C" {
    pub fn Tcl_NotifyChannel(channel: Tcl_Channel, mask: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_ObjGetVar2(
        interp: *mut Tcl_Interp,
        part1Ptr: *mut Tcl_Obj,
        part2Ptr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_ObjSetVar2(
        interp: *mut Tcl_Interp,
        part1Ptr: *mut Tcl_Obj,
        part2Ptr: *mut Tcl_Obj,
        newValuePtr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_OpenCommandChannel(
        interp: *mut Tcl_Interp,
        argc: ::std::os::raw::c_int,
        argv: *mut *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_OpenFileChannel(
        interp: *mut Tcl_Interp,
        fileName: *const ::std::os::raw::c_char,
        modeString: *const ::std::os::raw::c_char,
        permissions: ::std::os::raw::c_int,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_OpenTcpClient(
        interp: *mut Tcl_Interp,
        port: ::std::os::raw::c_int,
        address: *const ::std::os::raw::c_char,
        myaddr: *const ::std::os::raw::c_char,
        myport: ::std::os::raw::c_int,
        async_: ::std::os::raw::c_int,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_OpenTcpServer(
        interp: *mut Tcl_Interp,
        port: ::std::os::raw::c_int,
        host: *const ::std::os::raw::c_char,
        acceptProc: Tcl_TcpAcceptProc,
        callbackData: ClientData,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_Preserve(data: ClientData);
}
extern "C" {
    pub fn Tcl_PrintDouble(
        interp: *mut Tcl_Interp,
        value: f64,
        dst: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_PutEnv(
        assignment: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_PosixError(
        interp: *mut Tcl_Interp,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_QueueEvent(evPtr: *mut Tcl_Event, position: Tcl_QueuePosition);
}
extern "C" {
    pub fn Tcl_Read(
        chan: Tcl_Channel,
        bufPtr: *mut ::std::os::raw::c_char,
        toRead: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ReapDetachedProcs();
}
extern "C" {
    pub fn Tcl_RecordAndEval(
        interp: *mut Tcl_Interp,
        cmd: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_RecordAndEvalObj(
        interp: *mut Tcl_Interp,
        cmdPtr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_RegisterChannel(interp: *mut Tcl_Interp, chan: Tcl_Channel);
}
extern "C" {
    pub fn Tcl_RegisterObjType(typePtr: *const Tcl_ObjType);
}
extern "C" {
    pub fn Tcl_RegExpCompile(
        interp: *mut Tcl_Interp,
        pattern: *const ::std::os::raw::c_char,
    ) -> Tcl_RegExp;
}
extern "C" {
    pub fn Tcl_RegExpExec(
        interp: *mut Tcl_Interp,
        regexp: Tcl_RegExp,
        text: *const ::std::os::raw::c_char,
        start: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_RegExpMatch(
        interp: *mut Tcl_Interp,
        text: *const ::std::os::raw::c_char,
        pattern: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_RegExpRange(
        regexp: Tcl_RegExp,
        index: ::std::os::raw::c_int,
        startPtr: *mut *const ::std::os::raw::c_char,
        endPtr: *mut *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_Release(clientData: ClientData);
}
extern "C" {
    pub fn Tcl_ResetResult(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_ScanElement(
        src: *const ::std::os::raw::c_char,
        flagPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ScanCountedElement(
        src: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        flagPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SeekOld(
        chan: Tcl_Channel,
        offset: ::std::os::raw::c_int,
        mode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ServiceAll() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ServiceEvent(
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetAssocData(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        proc_: Tcl_InterpDeleteProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_SetChannelBufferSize(
        chan: Tcl_Channel,
        sz: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_SetChannelOption(
        interp: *mut Tcl_Interp,
        chan: Tcl_Channel,
        optionName: *const ::std::os::raw::c_char,
        newValue: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetCommandInfo(
        interp: *mut Tcl_Interp,
        cmdName: *const ::std::os::raw::c_char,
        infoPtr: *const Tcl_CmdInfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetErrno(err: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_SetErrorCode(interp: *mut Tcl_Interp, ...);
}
extern "C" {
    pub fn Tcl_SetMaxBlockTime(timePtr: *const Tcl_Time);
}
extern "C" {
    pub fn Tcl_SetPanicProc(panicProc: Tcl_PanicProc);
}
extern "C" {
    pub fn Tcl_SetRecursionLimit(
        interp: *mut Tcl_Interp,
        depth: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetResult(
        interp: *mut Tcl_Interp,
        result: *mut ::std::os::raw::c_char,
        freeProc: Tcl_FreeProc,
    );
}
extern "C" {
    pub fn Tcl_SetServiceMode(
        mode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetObjErrorCode(
        interp: *mut Tcl_Interp,
        errorObjPtr: *mut Tcl_Obj,
    );
}
extern "C" {
    pub fn Tcl_SetObjResult(
        interp: *mut Tcl_Interp,
        resultObjPtr: *mut Tcl_Obj,
    );
}
extern "C" {
    pub fn Tcl_SetStdChannel(
        channel: Tcl_Channel,
        type_: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_SetVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        newValue: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_SetVar2(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        newValue: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_SignalId(
        sig: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_SignalMsg(
        sig: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_SourceRCFile(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_SplitList(
        interp: *mut Tcl_Interp,
        listStr: *const ::std::os::raw::c_char,
        argcPtr: *mut ::std::os::raw::c_int,
        argvPtr: *mut *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SplitPath(
        path: *const ::std::os::raw::c_char,
        argcPtr: *mut ::std::os::raw::c_int,
        argvPtr: *mut *mut *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_StaticPackage(
        interp: *mut Tcl_Interp,
        pkgName: *const ::std::os::raw::c_char,
        initProc: Tcl_PackageInitProc,
        safeInitProc: Tcl_PackageInitProc,
    );
}
extern "C" {
    pub fn Tcl_StringMatch(
        str: *const ::std::os::raw::c_char,
        pattern: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_TellOld(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_TraceVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        proc_: Tcl_VarTraceProc,
        clientData: ClientData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_TraceVar2(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        proc_: Tcl_VarTraceProc,
        clientData: ClientData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_TranslateFileName(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        bufferPtr: *mut Tcl_DString,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_Ungets(
        chan: Tcl_Channel,
        str: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
        atHead: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UnlinkVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_UnregisterChannel(
        interp: *mut Tcl_Interp,
        chan: Tcl_Channel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UnsetVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UnsetVar2(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UntraceVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        proc_: Tcl_VarTraceProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_UntraceVar2(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        proc_: Tcl_VarTraceProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_UpdateLinkedVar(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_UpVar(
        interp: *mut Tcl_Interp,
        frameName: *const ::std::os::raw::c_char,
        varName: *const ::std::os::raw::c_char,
        localName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UpVar2(
        interp: *mut Tcl_Interp,
        frameName: *const ::std::os::raw::c_char,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        localName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_VarEval(interp: *mut Tcl_Interp, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_VarTraceInfo(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        procPtr: Tcl_VarTraceProc,
        prevClientData: ClientData,
    ) -> ClientData;
}
extern "C" {
    pub fn Tcl_VarTraceInfo2(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        procPtr: Tcl_VarTraceProc,
        prevClientData: ClientData,
    ) -> ClientData;
}
extern "C" {
    pub fn Tcl_Write(
        chan: Tcl_Channel,
        s: *const ::std::os::raw::c_char,
        slen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_WrongNumArgs(
        interp: *mut Tcl_Interp,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        message: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_DumpActiveMemory(
        fileName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ValidateAllMemory(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_AppendResultVA(
        interp: *mut Tcl_Interp,
        argList: *mut __va_list_tag,
    );
}
extern "C" {
    pub fn Tcl_AppendStringsToObjVA(
        objPtr: *mut Tcl_Obj,
        argList: *mut __va_list_tag,
    );
}
extern "C" {
    pub fn Tcl_HashStats(
        tablePtr: *mut Tcl_HashTable,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_ParseVar(
        interp: *mut Tcl_Interp,
        start: *const ::std::os::raw::c_char,
        termPtr: *mut *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_PkgPresent(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        version: *const ::std::os::raw::c_char,
        exact: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_PkgPresentEx(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        version: *const ::std::os::raw::c_char,
        exact: ::std::os::raw::c_int,
        clientDataPtr: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_PkgProvide(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        version: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_PkgRequire(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        version: *const ::std::os::raw::c_char,
        exact: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_SetErrorCodeVA(
        interp: *mut Tcl_Interp,
        argList: *mut __va_list_tag,
    );
}
extern "C" {
    pub fn Tcl_VarEvalVA(
        interp: *mut Tcl_Interp,
        argList: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_WaitPid(
        pid: Tcl_Pid,
        statPtr: *mut ::std::os::raw::c_int,
        options: ::std::os::raw::c_int,
    ) -> Tcl_Pid;
}
extern "C" {
    pub fn Tcl_PanicVA(
        format: *const ::std::os::raw::c_char,
        argList: *mut __va_list_tag,
    );
}
extern "C" {
    pub fn Tcl_GetVersion(
        major: *mut ::std::os::raw::c_int,
        minor: *mut ::std::os::raw::c_int,
        patchLevel: *mut ::std::os::raw::c_int,
        type_: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_InitMemory(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_StackChannel(
        interp: *mut Tcl_Interp,
        typePtr: *const Tcl_ChannelType,
        instanceData: ClientData,
        mask: ::std::os::raw::c_int,
        prevChan: Tcl_Channel,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_UnstackChannel(
        interp: *mut Tcl_Interp,
        chan: Tcl_Channel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetStackedChannel(chan: Tcl_Channel) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_SetMainLoop(proc_: Tcl_MainLoopProc);
}
extern "C" {
    pub fn Tcl_AppendObjToObj(objPtr: *mut Tcl_Obj, appendObjPtr: *mut Tcl_Obj);
}
extern "C" {
    pub fn Tcl_CreateEncoding(typePtr: *const Tcl_EncodingType)
        -> Tcl_Encoding;
}
extern "C" {
    pub fn Tcl_CreateThreadExitHandler(
        proc_: Tcl_ExitProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_DeleteThreadExitHandler(
        proc_: Tcl_ExitProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_DiscardResult(statePtr: *mut Tcl_SavedResult);
}
extern "C" {
    pub fn Tcl_EvalEx(
        interp: *mut Tcl_Interp,
        script: *const ::std::os::raw::c_char,
        numBytes: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_EvalObjv(
        interp: *mut Tcl_Interp,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_EvalObjEx(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExitThread(status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_ExternalToUtf(
        interp: *mut Tcl_Interp,
        encoding: Tcl_Encoding,
        src: *const ::std::os::raw::c_char,
        srcLen: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        statePtr: *mut Tcl_EncodingState,
        dst: *mut ::std::os::raw::c_char,
        dstLen: ::std::os::raw::c_int,
        srcReadPtr: *mut ::std::os::raw::c_int,
        dstWrotePtr: *mut ::std::os::raw::c_int,
        dstCharsPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ExternalToUtfDString(
        encoding: Tcl_Encoding,
        src: *const ::std::os::raw::c_char,
        srcLen: ::std::os::raw::c_int,
        dsPtr: *mut Tcl_DString,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_FinalizeThread();
}
extern "C" {
    pub fn Tcl_FinalizeNotifier(clientData: ClientData);
}
extern "C" {
    pub fn Tcl_FreeEncoding(encoding: Tcl_Encoding);
}
extern "C" {
    pub fn Tcl_GetCurrentThread() -> Tcl_ThreadId;
}
extern "C" {
    pub fn Tcl_GetEncoding(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
    ) -> Tcl_Encoding;
}
extern "C" {
    pub fn Tcl_GetEncodingName(
        encoding: Tcl_Encoding,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetEncodingNames(interp: *mut Tcl_Interp);
}
extern "C" {
    pub fn Tcl_GetIndexFromObjStruct(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        tablePtr: *const ::std::os::raw::c_void,
        offset: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        indexPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetThreadData(
        keyPtr: *mut Tcl_ThreadDataKey,
        size: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn Tcl_GetVar2Ex(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_InitNotifier() -> ClientData;
}
extern "C" {
    pub fn Tcl_MutexLock(mutexPtr: *mut Tcl_Mutex);
}
extern "C" {
    pub fn Tcl_MutexUnlock(mutexPtr: *mut Tcl_Mutex);
}
extern "C" {
    pub fn Tcl_ConditionNotify(condPtr: *mut Tcl_Condition);
}
extern "C" {
    pub fn Tcl_ConditionWait(
        condPtr: *mut Tcl_Condition,
        mutexPtr: *mut Tcl_Mutex,
        timePtr: *const Tcl_Time,
    );
}
extern "C" {
    pub fn Tcl_NumUtfChars(
        src: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ReadChars(
        channel: Tcl_Channel,
        objPtr: *mut Tcl_Obj,
        charsToRead: ::std::os::raw::c_int,
        appendFlag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_RestoreResult(
        interp: *mut Tcl_Interp,
        statePtr: *mut Tcl_SavedResult,
    );
}
extern "C" {
    pub fn Tcl_SaveResult(
        interp: *mut Tcl_Interp,
        statePtr: *mut Tcl_SavedResult,
    );
}
extern "C" {
    pub fn Tcl_SetSystemEncoding(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetVar2Ex(
        interp: *mut Tcl_Interp,
        part1: *const ::std::os::raw::c_char,
        part2: *const ::std::os::raw::c_char,
        newValuePtr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_ThreadAlert(threadId: Tcl_ThreadId);
}
extern "C" {
    pub fn Tcl_ThreadQueueEvent(
        threadId: Tcl_ThreadId,
        evPtr: *mut Tcl_Event,
        position: Tcl_QueuePosition,
    );
}
extern "C" {
    pub fn Tcl_UniCharAtIndex(
        src: *const ::std::os::raw::c_char,
        index: ::std::os::raw::c_int,
    ) -> Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_UniCharToLower(ch: ::std::os::raw::c_int) -> Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_UniCharToTitle(ch: ::std::os::raw::c_int) -> Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_UniCharToUpper(ch: ::std::os::raw::c_int) -> Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_UniCharToUtf(
        ch: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfAtIndex(
        src: *const ::std::os::raw::c_char,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_UtfCharComplete(
        src: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfBackslash(
        src: *const ::std::os::raw::c_char,
        readPtr: *mut ::std::os::raw::c_int,
        dst: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfFindFirst(
        src: *const ::std::os::raw::c_char,
        ch: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_UtfFindLast(
        src: *const ::std::os::raw::c_char,
        ch: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_UtfNext(
        src: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_UtfPrev(
        src: *const ::std::os::raw::c_char,
        start: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_UtfToExternal(
        interp: *mut Tcl_Interp,
        encoding: Tcl_Encoding,
        src: *const ::std::os::raw::c_char,
        srcLen: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        statePtr: *mut Tcl_EncodingState,
        dst: *mut ::std::os::raw::c_char,
        dstLen: ::std::os::raw::c_int,
        srcReadPtr: *mut ::std::os::raw::c_int,
        dstWrotePtr: *mut ::std::os::raw::c_int,
        dstCharsPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfToExternalDString(
        encoding: Tcl_Encoding,
        src: *const ::std::os::raw::c_char,
        srcLen: ::std::os::raw::c_int,
        dsPtr: *mut Tcl_DString,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_UtfToLower(
        src: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfToTitle(
        src: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfToUniChar(
        src: *const ::std::os::raw::c_char,
        chPtr: *mut Tcl_UniChar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfToUpper(
        src: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_WriteChars(
        chan: Tcl_Channel,
        src: *const ::std::os::raw::c_char,
        srcLen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_WriteObj(
        chan: Tcl_Channel,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetString(objPtr: *mut Tcl_Obj) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_GetDefaultEncodingDir() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_SetDefaultEncodingDir(path: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn Tcl_AlertNotifier(clientData: ClientData);
}
extern "C" {
    pub fn Tcl_ServiceModeHook(mode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Tcl_UniCharIsAlnum(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsAlpha(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsDigit(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsLower(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsSpace(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsUpper(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsWordChar(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharLen(uniStr: *const Tcl_UniChar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharNcmp(
        ucs: *const Tcl_UniChar,
        uct: *const Tcl_UniChar,
        numChars: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharToUtfDString(
        uniStr: *const Tcl_UniChar,
        uniLength: ::std::os::raw::c_int,
        dsPtr: *mut Tcl_DString,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_UtfToUniCharDString(
        src: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        dsPtr: *mut Tcl_DString,
    ) -> *mut Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_GetRegExpFromObj(
        interp: *mut Tcl_Interp,
        patObj: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> Tcl_RegExp;
}
extern "C" {
    pub fn Tcl_EvalTokens(
        interp: *mut Tcl_Interp,
        tokenPtr: *mut Tcl_Token,
        count: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FreeParse(parsePtr: *mut Tcl_Parse);
}
extern "C" {
    pub fn Tcl_LogCommandInfo(
        interp: *mut Tcl_Interp,
        script: *const ::std::os::raw::c_char,
        command: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_ParseBraces(
        interp: *mut Tcl_Interp,
        start: *const ::std::os::raw::c_char,
        numBytes: ::std::os::raw::c_int,
        parsePtr: *mut Tcl_Parse,
        append: ::std::os::raw::c_int,
        termPtr: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ParseCommand(
        interp: *mut Tcl_Interp,
        start: *const ::std::os::raw::c_char,
        numBytes: ::std::os::raw::c_int,
        nested: ::std::os::raw::c_int,
        parsePtr: *mut Tcl_Parse,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ParseExpr(
        interp: *mut Tcl_Interp,
        start: *const ::std::os::raw::c_char,
        numBytes: ::std::os::raw::c_int,
        parsePtr: *mut Tcl_Parse,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ParseQuotedString(
        interp: *mut Tcl_Interp,
        start: *const ::std::os::raw::c_char,
        numBytes: ::std::os::raw::c_int,
        parsePtr: *mut Tcl_Parse,
        append: ::std::os::raw::c_int,
        termPtr: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ParseVarName(
        interp: *mut Tcl_Interp,
        start: *const ::std::os::raw::c_char,
        numBytes: ::std::os::raw::c_int,
        parsePtr: *mut Tcl_Parse,
        append: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetCwd(
        interp: *mut Tcl_Interp,
        cwdPtr: *mut Tcl_DString,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_Chdir(
        dirName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Access(
        path: *const ::std::os::raw::c_char,
        mode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Stat(
        path: *const ::std::os::raw::c_char,
        bufPtr: *mut stat,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfNcmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
        n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UtfNcasecmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
        n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_StringCaseMatch(
        str: *const ::std::os::raw::c_char,
        pattern: *const ::std::os::raw::c_char,
        nocase: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsControl(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsGraph(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsPrint(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharIsPunct(
        ch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_RegExpExecObj(
        interp: *mut Tcl_Interp,
        regexp: Tcl_RegExp,
        textObj: *mut Tcl_Obj,
        offset: ::std::os::raw::c_int,
        nmatches: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_RegExpGetInfo(regexp: Tcl_RegExp, infoPtr: *mut Tcl_RegExpInfo);
}
extern "C" {
    pub fn Tcl_NewUnicodeObj(
        unicode: *const Tcl_UniChar,
        numChars: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_SetUnicodeObj(
        objPtr: *mut Tcl_Obj,
        unicode: *const Tcl_UniChar,
        numChars: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_GetCharLength(objPtr: *mut Tcl_Obj) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetUniChar(
        objPtr: *mut Tcl_Obj,
        index: ::std::os::raw::c_int,
    ) -> Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_GetUnicode(objPtr: *mut Tcl_Obj) -> *mut Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_GetRange(
        objPtr: *mut Tcl_Obj,
        first: ::std::os::raw::c_int,
        last: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_AppendUnicodeToObj(
        objPtr: *mut Tcl_Obj,
        unicode: *const Tcl_UniChar,
        length: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_RegExpMatchObj(
        interp: *mut Tcl_Interp,
        textObj: *mut Tcl_Obj,
        patternObj: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetNotifier(notifierProcPtr: *mut Tcl_NotifierProcs);
}
extern "C" {
    pub fn Tcl_GetAllocMutex() -> *mut Tcl_Mutex;
}
extern "C" {
    pub fn Tcl_GetChannelNames(
        interp: *mut Tcl_Interp,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetChannelNamesEx(
        interp: *mut Tcl_Interp,
        pattern: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ProcObjCmd(
        clientData: ClientData,
        interp: *mut Tcl_Interp,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ConditionFinalize(condPtr: *mut Tcl_Condition);
}
extern "C" {
    pub fn Tcl_MutexFinalize(mutex: *mut Tcl_Mutex);
}
extern "C" {
    pub fn Tcl_CreateThread(
        idPtr: *mut Tcl_ThreadId,
        proc_: Tcl_ThreadCreateProc,
        clientData: ClientData,
        stackSize: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ReadRaw(
        chan: Tcl_Channel,
        dst: *mut ::std::os::raw::c_char,
        bytesToRead: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_WriteRaw(
        chan: Tcl_Channel,
        src: *const ::std::os::raw::c_char,
        srcLen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetTopChannel(chan: Tcl_Channel) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_ChannelBuffered(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ChannelName(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_ChannelVersion(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_ChannelTypeVersion;
}
extern "C" {
    pub fn Tcl_ChannelBlockModeProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverBlockModeProc;
}
extern "C" {
    pub fn Tcl_ChannelCloseProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverCloseProc;
}
extern "C" {
    pub fn Tcl_ChannelClose2Proc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverClose2Proc;
}
extern "C" {
    pub fn Tcl_ChannelInputProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverInputProc;
}
extern "C" {
    pub fn Tcl_ChannelOutputProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverOutputProc;
}
extern "C" {
    pub fn Tcl_ChannelSeekProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverSeekProc;
}
extern "C" {
    pub fn Tcl_ChannelSetOptionProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverSetOptionProc;
}
extern "C" {
    pub fn Tcl_ChannelGetOptionProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverGetOptionProc;
}
extern "C" {
    pub fn Tcl_ChannelWatchProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverWatchProc;
}
extern "C" {
    pub fn Tcl_ChannelGetHandleProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverGetHandleProc;
}
extern "C" {
    pub fn Tcl_ChannelFlushProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverFlushProc;
}
extern "C" {
    pub fn Tcl_ChannelHandlerProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverHandlerProc;
}
extern "C" {
    pub fn Tcl_JoinThread(
        threadId: Tcl_ThreadId,
        result: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_IsChannelShared(channel: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_IsChannelRegistered(
        interp: *mut Tcl_Interp,
        channel: Tcl_Channel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CutChannel(channel: Tcl_Channel);
}
extern "C" {
    pub fn Tcl_SpliceChannel(channel: Tcl_Channel);
}
extern "C" {
    pub fn Tcl_ClearChannelHandlers(channel: Tcl_Channel);
}
extern "C" {
    pub fn Tcl_IsChannelExisting(
        channelName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharNcasecmp(
        ucs: *const Tcl_UniChar,
        uct: *const Tcl_UniChar,
        numChars: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UniCharCaseMatch(
        uniStr: *const Tcl_UniChar,
        uniPattern: *const Tcl_UniChar,
        nocase: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FindHashEntry(
        tablePtr: *mut Tcl_HashTable,
        key: *const ::std::os::raw::c_void,
    ) -> *mut Tcl_HashEntry;
}
extern "C" {
    pub fn Tcl_CreateHashEntry(
        tablePtr: *mut Tcl_HashTable,
        key: *const ::std::os::raw::c_void,
        newPtr: *mut ::std::os::raw::c_int,
    ) -> *mut Tcl_HashEntry;
}
extern "C" {
    pub fn Tcl_InitCustomHashTable(
        tablePtr: *mut Tcl_HashTable,
        keyType: ::std::os::raw::c_int,
        typePtr: *const Tcl_HashKeyType,
    );
}
extern "C" {
    pub fn Tcl_InitObjHashTable(tablePtr: *mut Tcl_HashTable);
}
extern "C" {
    pub fn Tcl_CommandTraceInfo(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        procPtr: Tcl_CommandTraceProc,
        prevClientData: ClientData,
    ) -> ClientData;
}
extern "C" {
    pub fn Tcl_TraceCommand(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        proc_: Tcl_CommandTraceProc,
        clientData: ClientData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_UntraceCommand(
        interp: *mut Tcl_Interp,
        varName: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        proc_: Tcl_CommandTraceProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_AttemptAlloc(
        size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_AttemptDbCkalloc(
        size: ::std::os::raw::c_uint,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_AttemptRealloc(
        ptr: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_AttemptDbCkrealloc(
        ptr: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_uint,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_AttemptSetObjLength(
        objPtr: *mut Tcl_Obj,
        length: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetChannelThread(channel: Tcl_Channel) -> Tcl_ThreadId;
}
extern "C" {
    pub fn Tcl_GetUnicodeFromObj(
        objPtr: *mut Tcl_Obj,
        lengthPtr: *mut ::std::os::raw::c_int,
    ) -> *mut Tcl_UniChar;
}
extern "C" {
    pub fn Tcl_GetMathFuncInfo(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        numArgsPtr: *mut ::std::os::raw::c_int,
        argTypesPtr: *mut *mut Tcl_ValueType,
        procPtr: *mut Tcl_MathProc,
        clientDataPtr: *mut ClientData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ListMathFuncs(
        interp: *mut Tcl_Interp,
        pattern: *const ::std::os::raw::c_char,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_SubstObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DetachChannel(
        interp: *mut Tcl_Interp,
        channel: Tcl_Channel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_IsStandardChannel(channel: Tcl_Channel)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSCopyFile(
        srcPathPtr: *mut Tcl_Obj,
        destPathPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSCopyDirectory(
        srcPathPtr: *mut Tcl_Obj,
        destPathPtr: *mut Tcl_Obj,
        errorPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSCreateDirectory(
        pathPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSDeleteFile(pathPtr: *mut Tcl_Obj) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSLoadFile(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
        sym1: *const ::std::os::raw::c_char,
        sym2: *const ::std::os::raw::c_char,
        proc1Ptr: *mut Tcl_PackageInitProc,
        proc2Ptr: *mut Tcl_PackageInitProc,
        handlePtr: *mut Tcl_LoadHandle,
        unloadProcPtr: *mut Tcl_FSUnloadFileProc,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSMatchInDirectory(
        interp: *mut Tcl_Interp,
        result: *mut Tcl_Obj,
        pathPtr: *mut Tcl_Obj,
        pattern: *const ::std::os::raw::c_char,
        types: *mut Tcl_GlobTypeData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSLink(
        pathPtr: *mut Tcl_Obj,
        toPtr: *mut Tcl_Obj,
        linkAction: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSRemoveDirectory(
        pathPtr: *mut Tcl_Obj,
        recursive: ::std::os::raw::c_int,
        errorPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSRenameFile(
        srcPathPtr: *mut Tcl_Obj,
        destPathPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSLstat(
        pathPtr: *mut Tcl_Obj,
        buf: *mut Tcl_StatBuf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSUtime(
        pathPtr: *mut Tcl_Obj,
        tval: *mut utimbuf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSFileAttrsGet(
        interp: *mut Tcl_Interp,
        index: ::std::os::raw::c_int,
        pathPtr: *mut Tcl_Obj,
        objPtrRef: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSFileAttrsSet(
        interp: *mut Tcl_Interp,
        index: ::std::os::raw::c_int,
        pathPtr: *mut Tcl_Obj,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSFileAttrStrings(
        pathPtr: *mut Tcl_Obj,
        objPtrRef: *mut *mut Tcl_Obj,
    ) -> *const *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_FSStat(
        pathPtr: *mut Tcl_Obj,
        buf: *mut Tcl_StatBuf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSAccess(
        pathPtr: *mut Tcl_Obj,
        mode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSOpenFileChannel(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
        modeString: *const ::std::os::raw::c_char,
        permissions: ::std::os::raw::c_int,
    ) -> Tcl_Channel;
}
extern "C" {
    pub fn Tcl_FSGetCwd(interp: *mut Tcl_Interp) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSChdir(pathPtr: *mut Tcl_Obj) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSConvertToPathType(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSJoinPath(
        listObj: *mut Tcl_Obj,
        elements: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSSplitPath(
        pathPtr: *mut Tcl_Obj,
        lenPtr: *mut ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSEqualPaths(
        firstPtr: *mut Tcl_Obj,
        secondPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSGetNormalizedPath(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSJoinToPath(
        pathPtr: *mut Tcl_Obj,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSGetInternalRep(
        pathPtr: *mut Tcl_Obj,
        fsPtr: *const Tcl_Filesystem,
    ) -> ClientData;
}
extern "C" {
    pub fn Tcl_FSGetTranslatedPath(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSEvalFile(
        interp: *mut Tcl_Interp,
        fileName: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSNewNativePath(
        fromFilesystem: *const Tcl_Filesystem,
        clientData: ClientData,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSGetNativePath(
        pathPtr: *mut Tcl_Obj,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn Tcl_FSFileSystemInfo(pathPtr: *mut Tcl_Obj) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSPathSeparator(pathPtr: *mut Tcl_Obj) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSListVolumes() -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_FSRegister(
        clientData: ClientData,
        fsPtr: *const Tcl_Filesystem,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSUnregister(
        fsPtr: *const Tcl_Filesystem,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSData(fsPtr: *const Tcl_Filesystem) -> ClientData;
}
extern "C" {
    pub fn Tcl_FSGetTranslatedStringPath(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_FSGetFileSystemForPath(
        pathPtr: *mut Tcl_Obj,
    ) -> *const Tcl_Filesystem;
}
extern "C" {
    pub fn Tcl_FSGetPathType(pathPtr: *mut Tcl_Obj) -> Tcl_PathType;
}
extern "C" {
    pub fn Tcl_OutputBuffered(chan: Tcl_Channel) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FSMountsChanged(fsPtr: *const Tcl_Filesystem);
}
extern "C" {
    pub fn Tcl_EvalTokensStandard(
        interp: *mut Tcl_Interp,
        tokenPtr: *mut Tcl_Token,
        count: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetTime(timeBuf: *mut Tcl_Time);
}
extern "C" {
    pub fn Tcl_CreateObjTrace(
        interp: *mut Tcl_Interp,
        level: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
        objProc: Tcl_CmdObjTraceProc,
        clientData: ClientData,
        delProc: Tcl_CmdObjTraceDeleteProc,
    ) -> Tcl_Trace;
}
extern "C" {
    pub fn Tcl_GetCommandInfoFromToken(
        token: Tcl_Command,
        infoPtr: *mut Tcl_CmdInfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetCommandInfoFromToken(
        token: Tcl_Command,
        infoPtr: *const Tcl_CmdInfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DbNewWideIntObj(
        wideValue: Tcl_WideInt,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_GetWideIntFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        widePtr: *mut Tcl_WideInt,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NewWideIntObj(wideValue: Tcl_WideInt) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_SetWideIntObj(objPtr: *mut Tcl_Obj, wideValue: Tcl_WideInt);
}
extern "C" {
    pub fn Tcl_AllocStatBuf() -> *mut Tcl_StatBuf;
}
extern "C" {
    pub fn Tcl_Seek(
        chan: Tcl_Channel,
        offset: Tcl_WideInt,
        mode: ::std::os::raw::c_int,
    ) -> Tcl_WideInt;
}
extern "C" {
    pub fn Tcl_Tell(chan: Tcl_Channel) -> Tcl_WideInt;
}
extern "C" {
    pub fn Tcl_ChannelWideSeekProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverWideSeekProc;
}
extern "C" {
    pub fn Tcl_DictObjPut(
        interp: *mut Tcl_Interp,
        dictPtr: *mut Tcl_Obj,
        keyPtr: *mut Tcl_Obj,
        valuePtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DictObjGet(
        interp: *mut Tcl_Interp,
        dictPtr: *mut Tcl_Obj,
        keyPtr: *mut Tcl_Obj,
        valuePtrPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DictObjRemove(
        interp: *mut Tcl_Interp,
        dictPtr: *mut Tcl_Obj,
        keyPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DictObjSize(
        interp: *mut Tcl_Interp,
        dictPtr: *mut Tcl_Obj,
        sizePtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DictObjFirst(
        interp: *mut Tcl_Interp,
        dictPtr: *mut Tcl_Obj,
        searchPtr: *mut Tcl_DictSearch,
        keyPtrPtr: *mut *mut Tcl_Obj,
        valuePtrPtr: *mut *mut Tcl_Obj,
        donePtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DictObjNext(
        searchPtr: *mut Tcl_DictSearch,
        keyPtrPtr: *mut *mut Tcl_Obj,
        valuePtrPtr: *mut *mut Tcl_Obj,
        donePtr: *mut ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_DictObjDone(searchPtr: *mut Tcl_DictSearch);
}
extern "C" {
    pub fn Tcl_DictObjPutKeyList(
        interp: *mut Tcl_Interp,
        dictPtr: *mut Tcl_Obj,
        keyc: ::std::os::raw::c_int,
        keyv: *const *mut Tcl_Obj,
        valuePtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DictObjRemoveKeyList(
        interp: *mut Tcl_Interp,
        dictPtr: *mut Tcl_Obj,
        keyc: ::std::os::raw::c_int,
        keyv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NewDictObj() -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewDictObj(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_RegisterConfig(
        interp: *mut Tcl_Interp,
        pkgName: *const ::std::os::raw::c_char,
        configuration: *const Tcl_Config,
        valEncoding: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_CreateNamespace(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        clientData: ClientData,
        deleteProc: Tcl_NamespaceDeleteProc,
    ) -> *mut Tcl_Namespace;
}
extern "C" {
    pub fn Tcl_DeleteNamespace(nsPtr: *mut Tcl_Namespace);
}
extern "C" {
    pub fn Tcl_AppendExportList(
        interp: *mut Tcl_Interp,
        nsPtr: *mut Tcl_Namespace,
        objPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Export(
        interp: *mut Tcl_Interp,
        nsPtr: *mut Tcl_Namespace,
        pattern: *const ::std::os::raw::c_char,
        resetListFirst: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Import(
        interp: *mut Tcl_Interp,
        nsPtr: *mut Tcl_Namespace,
        pattern: *const ::std::os::raw::c_char,
        allowOverwrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ForgetImport(
        interp: *mut Tcl_Interp,
        nsPtr: *mut Tcl_Namespace,
        pattern: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetCurrentNamespace(
        interp: *mut Tcl_Interp,
    ) -> *mut Tcl_Namespace;
}
extern "C" {
    pub fn Tcl_GetGlobalNamespace(
        interp: *mut Tcl_Interp,
    ) -> *mut Tcl_Namespace;
}
extern "C" {
    pub fn Tcl_FindNamespace(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        contextNsPtr: *mut Tcl_Namespace,
        flags: ::std::os::raw::c_int,
    ) -> *mut Tcl_Namespace;
}
extern "C" {
    pub fn Tcl_FindCommand(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        contextNsPtr: *mut Tcl_Namespace,
        flags: ::std::os::raw::c_int,
    ) -> Tcl_Command;
}
extern "C" {
    pub fn Tcl_GetCommandFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
    ) -> Tcl_Command;
}
extern "C" {
    pub fn Tcl_GetCommandFullName(
        interp: *mut Tcl_Interp,
        command: Tcl_Command,
        objPtr: *mut Tcl_Obj,
    );
}
extern "C" {
    pub fn Tcl_FSEvalFileEx(
        interp: *mut Tcl_Interp,
        fileName: *mut Tcl_Obj,
        encodingName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetExitProc(proc_: Tcl_ExitProc) -> Tcl_ExitProc;
}
extern "C" {
    pub fn Tcl_LimitAddHandler(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
        handlerProc: Tcl_LimitHandlerProc,
        clientData: ClientData,
        deleteProc: Tcl_LimitHandlerDeleteProc,
    );
}
extern "C" {
    pub fn Tcl_LimitRemoveHandler(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
        handlerProc: Tcl_LimitHandlerProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_LimitReady(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_LimitCheck(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_LimitExceeded(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_LimitSetCommands(
        interp: *mut Tcl_Interp,
        commandLimit: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_LimitSetTime(
        interp: *mut Tcl_Interp,
        timeLimitPtr: *mut Tcl_Time,
    );
}
extern "C" {
    pub fn Tcl_LimitSetGranularity(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
        granularity: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_LimitTypeEnabled(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_LimitTypeExceeded(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_LimitTypeSet(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_LimitTypeReset(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_LimitGetCommands(
        interp: *mut Tcl_Interp,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_LimitGetTime(
        interp: *mut Tcl_Interp,
        timeLimitPtr: *mut Tcl_Time,
    );
}
extern "C" {
    pub fn Tcl_LimitGetGranularity(
        interp: *mut Tcl_Interp,
        type_: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SaveInterpState(
        interp: *mut Tcl_Interp,
        status: ::std::os::raw::c_int,
    ) -> Tcl_InterpState;
}
extern "C" {
    pub fn Tcl_RestoreInterpState(
        interp: *mut Tcl_Interp,
        state: Tcl_InterpState,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_DiscardInterpState(state: Tcl_InterpState);
}
extern "C" {
    pub fn Tcl_SetReturnOptions(
        interp: *mut Tcl_Interp,
        options: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetReturnOptions(
        interp: *mut Tcl_Interp,
        result: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_IsEnsemble(token: Tcl_Command) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CreateEnsemble(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        namespacePtr: *mut Tcl_Namespace,
        flags: ::std::os::raw::c_int,
    ) -> Tcl_Command;
}
extern "C" {
    pub fn Tcl_FindEnsemble(
        interp: *mut Tcl_Interp,
        cmdNameObj: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> Tcl_Command;
}
extern "C" {
    pub fn Tcl_SetEnsembleSubcommandList(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        subcmdList: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetEnsembleMappingDict(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        mapDict: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetEnsembleUnknownHandler(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        unknownList: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetEnsembleFlags(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEnsembleSubcommandList(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        subcmdListPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEnsembleMappingDict(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        mapDictPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEnsembleUnknownHandler(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        unknownListPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEnsembleFlags(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        flagsPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEnsembleNamespace(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        namespacePtrPtr: *mut *mut Tcl_Namespace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetTimeProc(
        getProc: Tcl_GetTimeProc,
        scaleProc: Tcl_ScaleTimeProc,
        clientData: ClientData,
    );
}
extern "C" {
    pub fn Tcl_QueryTimeProc(
        getProc: *mut Tcl_GetTimeProc,
        scaleProc: *mut Tcl_ScaleTimeProc,
        clientData: *mut ClientData,
    );
}
extern "C" {
    pub fn Tcl_ChannelThreadActionProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverThreadActionProc;
}
extern "C" {
    pub fn Tcl_NewBignumObj(value: *mut mp_int) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_DbNewBignumObj(
        value: *mut mp_int,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_SetBignumObj(obj: *mut Tcl_Obj, value: *mut mp_int);
}
extern "C" {
    pub fn Tcl_GetBignumFromObj(
        interp: *mut Tcl_Interp,
        obj: *mut Tcl_Obj,
        value: *mut mp_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_TakeBignumFromObj(
        interp: *mut Tcl_Interp,
        obj: *mut Tcl_Obj,
        value: *mut mp_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_TruncateChannel(
        chan: Tcl_Channel,
        length: Tcl_WideInt,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ChannelTruncateProc(
        chanTypePtr: *const Tcl_ChannelType,
    ) -> Tcl_DriverTruncateProc;
}
extern "C" {
    pub fn Tcl_SetChannelErrorInterp(
        interp: *mut Tcl_Interp,
        msg: *mut Tcl_Obj,
    );
}
extern "C" {
    pub fn Tcl_GetChannelErrorInterp(
        interp: *mut Tcl_Interp,
        msg: *mut *mut Tcl_Obj,
    );
}
extern "C" {
    pub fn Tcl_SetChannelError(chan: Tcl_Channel, msg: *mut Tcl_Obj);
}
extern "C" {
    pub fn Tcl_GetChannelError(chan: Tcl_Channel, msg: *mut *mut Tcl_Obj);
}
extern "C" {
    pub fn Tcl_InitBignumFromDouble(
        interp: *mut Tcl_Interp,
        initval: f64,
        toInit: *mut mp_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetNamespaceUnknownHandler(
        interp: *mut Tcl_Interp,
        nsPtr: *mut Tcl_Namespace,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_SetNamespaceUnknownHandler(
        interp: *mut Tcl_Interp,
        nsPtr: *mut Tcl_Namespace,
        handlerPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEncodingFromObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        encodingPtr: *mut Tcl_Encoding,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEncodingSearchPath() -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_SetEncodingSearchPath(
        searchPath: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEncodingNameFromEnvironment(
        bufPtr: *mut Tcl_DString,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn Tcl_PkgRequireProc(
        interp: *mut Tcl_Interp,
        name: *const ::std::os::raw::c_char,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        clientDataPtr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_AppendObjToErrorInfo(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
    );
}
extern "C" {
    pub fn Tcl_AppendLimitedToObj(
        objPtr: *mut Tcl_Obj,
        bytes: *const ::std::os::raw::c_char,
        length: ::std::os::raw::c_int,
        limit: ::std::os::raw::c_int,
        ellipsis: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_Format(
        interp: *mut Tcl_Interp,
        format: *const ::std::os::raw::c_char,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_AppendFormatToObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        format: *const ::std::os::raw::c_char,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ObjPrintf(
        format: *const ::std::os::raw::c_char,
        ...
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_AppendPrintfToObj(
        objPtr: *mut Tcl_Obj,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn Tcl_CancelEval(
        interp: *mut Tcl_Interp,
        resultObjPtr: *mut Tcl_Obj,
        clientData: ClientData,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_Canceled(
        interp: *mut Tcl_Interp,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_CreatePipe(
        interp: *mut Tcl_Interp,
        rchan: *mut Tcl_Channel,
        wchan: *mut Tcl_Channel,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NRCreateCommand(
        interp: *mut Tcl_Interp,
        cmdName: *const ::std::os::raw::c_char,
        proc_: Tcl_ObjCmdProc,
        nreProc: Tcl_ObjCmdProc,
        clientData: ClientData,
        deleteProc: Tcl_CmdDeleteProc,
    ) -> Tcl_Command;
}
extern "C" {
    pub fn Tcl_NREvalObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NREvalObjv(
        interp: *mut Tcl_Interp,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NRCmdSwap(
        interp: *mut Tcl_Interp,
        cmd: Tcl_Command,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NRAddCallback(
        interp: *mut Tcl_Interp,
        postProcPtr: Tcl_NRPostProc,
        data0: ClientData,
        data1: ClientData,
        data2: ClientData,
        data3: ClientData,
    );
}
extern "C" {
    pub fn Tcl_NRCallObjProc(
        interp: *mut Tcl_Interp,
        objProc: Tcl_ObjCmdProc,
        clientData: ClientData,
        objc: ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetFSDeviceFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn Tcl_GetFSInodeFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn Tcl_GetModeFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn Tcl_GetLinkCountFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetUserIdFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetGroupIdFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetDeviceTypeFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetAccessTimeFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> Tcl_WideInt;
}
extern "C" {
    pub fn Tcl_GetModificationTimeFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> Tcl_WideInt;
}
extern "C" {
    pub fn Tcl_GetChangeTimeFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> Tcl_WideInt;
}
extern "C" {
    pub fn Tcl_GetSizeFromStat(statPtr: *const Tcl_StatBuf) -> Tcl_WideUInt;
}
extern "C" {
    pub fn Tcl_GetBlocksFromStat(statPtr: *const Tcl_StatBuf) -> Tcl_WideUInt;
}
extern "C" {
    pub fn Tcl_GetBlockSizeFromStat(
        statPtr: *const Tcl_StatBuf,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn Tcl_SetEnsembleParameterList(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        paramList: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetEnsembleParameterList(
        interp: *mut Tcl_Interp,
        token: Tcl_Command,
        paramListPtr: *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ParseArgsObjv(
        interp: *mut Tcl_Interp,
        argTable: *const Tcl_ArgvInfo,
        objcPtr: *mut ::std::os::raw::c_int,
        objv: *const *mut Tcl_Obj,
        remObjv: *mut *mut *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_GetErrorLine(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetErrorLine(
        interp: *mut Tcl_Interp,
        lineNum: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_TransferResult(
        sourceInterp: *mut Tcl_Interp,
        result: ::std::os::raw::c_int,
        targetInterp: *mut Tcl_Interp,
    );
}
extern "C" {
    pub fn Tcl_InterpActive(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_BackgroundException(
        interp: *mut Tcl_Interp,
        code: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Tcl_ZlibDeflate(
        interp: *mut Tcl_Interp,
        format: ::std::os::raw::c_int,
        data: *mut Tcl_Obj,
        level: ::std::os::raw::c_int,
        gzipHeaderDictObj: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibInflate(
        interp: *mut Tcl_Interp,
        format: ::std::os::raw::c_int,
        data: *mut Tcl_Obj,
        buffersize: ::std::os::raw::c_int,
        gzipHeaderDictObj: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibCRC32(
        crc: ::std::os::raw::c_uint,
        buf: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn Tcl_ZlibAdler32(
        adler: ::std::os::raw::c_uint,
        buf: *const ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn Tcl_ZlibStreamInit(
        interp: *mut Tcl_Interp,
        mode: ::std::os::raw::c_int,
        format: ::std::os::raw::c_int,
        level: ::std::os::raw::c_int,
        dictObj: *mut Tcl_Obj,
        zshandle: *mut Tcl_ZlibStream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibStreamGetCommandName(
        zshandle: Tcl_ZlibStream,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_ZlibStreamEof(zshandle: Tcl_ZlibStream)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibStreamChecksum(
        zshandle: Tcl_ZlibStream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibStreamPut(
        zshandle: Tcl_ZlibStream,
        data: *mut Tcl_Obj,
        flush: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibStreamGet(
        zshandle: Tcl_ZlibStream,
        data: *mut Tcl_Obj,
        count: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibStreamClose(
        zshandle: Tcl_ZlibStream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibStreamReset(
        zshandle: Tcl_ZlibStream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_SetStartupScript(
        path: *mut Tcl_Obj,
        encoding: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn Tcl_GetStartupScript(
        encodingPtr: *mut *const ::std::os::raw::c_char,
    ) -> *mut Tcl_Obj;
}
extern "C" {
    pub fn Tcl_CloseEx(
        interp: *mut Tcl_Interp,
        chan: Tcl_Channel,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NRExprObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        resultPtr: *mut Tcl_Obj,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_NRSubstObj(
        interp: *mut Tcl_Interp,
        objPtr: *mut Tcl_Obj,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_LoadFile(
        interp: *mut Tcl_Interp,
        pathPtr: *mut Tcl_Obj,
        symv: *const *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        procPtrs: *mut ::std::os::raw::c_void,
        handlePtr: *mut Tcl_LoadHandle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_FindSymbol(
        interp: *mut Tcl_Interp,
        handle: Tcl_LoadHandle,
        symbol: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn Tcl_FSUnloadFile(
        interp: *mut Tcl_Interp,
        handlePtr: Tcl_LoadHandle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Tcl_ZlibStreamSetCompressionDictionary(
        zhandle: Tcl_ZlibStream,
        compressionDictionaryObj: *mut Tcl_Obj,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TclStubHooks {
    pub tclPlatStubs: *const TclPlatStubs,
    pub tclIntStubs: *mut TclIntStubs,
    pub tclIntPlatStubs: *mut TclIntPlatStubs,
}
#[test]
fn bindgen_test_layout_TclStubHooks() {
    assert_eq!(
        ::std::mem::size_of::<TclStubHooks>(),
        24usize,
        concat!("Size of: ", stringify!(TclStubHooks))
    );
    assert_eq!(
        ::std::mem::align_of::<TclStubHooks>(),
        8usize,
        concat!("Alignment of ", stringify!(TclStubHooks))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<TclStubHooks>())).tclPlatStubs as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TclStubHooks),
            "::",
            stringify!(tclPlatStubs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<TclStubHooks>())).tclIntStubs as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TclStubHooks),
            "::",
            stringify!(tclIntStubs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<TclStubHooks>())).tclIntPlatStubs as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TclStubHooks),
            "::",
            stringify!(tclIntPlatStubs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TclStubs {
    pub magic: ::std::os::raw::c_int,
    pub hooks: *const TclStubHooks,
    pub tcl_PkgProvideEx: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            name: *const ::std::os::raw::c_char,
            version: *const ::std::os::raw::c_char,
            clientData: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_PkgRequireEx: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            name: *const ::std::os::raw::c_char,
            version: *const ::std::os::raw::c_char,
            exact: ::std::os::raw::c_int,
            clientDataPtr: *mut ::std::os::raw::c_void,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub tcl_Panic: ::std::option::Option<
        unsafe extern "C" fn(format: *const ::std::os::raw::c_char, ...),
    >,
    pub tcl_Alloc: ::std::option::Option<
        unsafe extern "C" fn(size: ::std::os::raw::c_uint)
            -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_Free: ::std::option::Option<
        unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_char),
    >,
    pub tcl_Realloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_char,
            size: ::std::os::raw::c_uint,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_DbCkalloc: ::std::option::Option<
        unsafe extern "C" fn(
            size: ::std::os::raw::c_uint,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_DbCkfree: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_char,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_DbCkrealloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_char,
            size: ::std::os::raw::c_uint,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_CreateFileHandler: ::std::option::Option<
        unsafe extern "C" fn(
            fd: ::std::os::raw::c_int,
            mask: ::std::os::raw::c_int,
            proc_: Tcl_FileProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_DeleteFileHandler:
        ::std::option::Option<unsafe extern "C" fn(fd: ::std::os::raw::c_int)>,
    pub tcl_SetTimer:
        ::std::option::Option<unsafe extern "C" fn(timePtr: *const Tcl_Time)>,
    pub tcl_Sleep:
        ::std::option::Option<unsafe extern "C" fn(ms: ::std::os::raw::c_int)>,
    pub tcl_WaitForEvent: ::std::option::Option<
        unsafe extern "C" fn(timePtr: *const Tcl_Time) -> ::std::os::raw::c_int,
    >,
    pub tcl_AppendAllObjTypes: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, objPtr: *mut Tcl_Obj)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_AppendStringsToObj:
        ::std::option::Option<unsafe extern "C" fn(objPtr: *mut Tcl_Obj, ...)>,
    pub tcl_AppendToObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            bytes: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_ConcatObj: ::std::option::Option<
        unsafe extern "C" fn(
            objc: ::std::os::raw::c_int,
            objv: *const *mut Tcl_Obj,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_ConvertToType: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            typePtr: *const Tcl_ObjType,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_DbDecrRefCount: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_DbIncrRefCount: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_DbIsShared: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_DbNewBooleanObj: ::std::option::Option<
        unsafe extern "C" fn(
            boolValue: ::std::os::raw::c_int,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_DbNewByteArrayObj: ::std::option::Option<
        unsafe extern "C" fn(
            bytes: *const ::std::os::raw::c_uchar,
            length: ::std::os::raw::c_int,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_DbNewDoubleObj: ::std::option::Option<
        unsafe extern "C" fn(
            doubleValue: f64,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_DbNewListObj: ::std::option::Option<
        unsafe extern "C" fn(
            objc: ::std::os::raw::c_int,
            objv: *const *mut Tcl_Obj,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_DbNewLongObj: ::std::option::Option<
        unsafe extern "C" fn(
            longValue: ::std::os::raw::c_long,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_DbNewObj: ::std::option::Option<
        unsafe extern "C" fn(
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_DbNewStringObj: ::std::option::Option<
        unsafe extern "C" fn(
            bytes: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_DuplicateObj: ::std::option::Option<
        unsafe extern "C" fn(objPtr: *mut Tcl_Obj) -> *mut Tcl_Obj,
    >,
    pub tclFreeObj:
        ::std::option::Option<unsafe extern "C" fn(objPtr: *mut Tcl_Obj)>,
    pub tcl_GetBoolean: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            src: *const ::std::os::raw::c_char,
            boolPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetBooleanFromObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            boolPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetByteArrayFromObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            lengthPtr: *mut ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_uchar,
    >,
    pub tcl_GetDouble: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            src: *const ::std::os::raw::c_char,
            doublePtr: *mut f64,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetDoubleFromObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            doublePtr: *mut f64,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetIndexFromObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            tablePtr: *const *const ::std::os::raw::c_char,
            msg: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
            indexPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetInt: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            src: *const ::std::os::raw::c_char,
            intPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetIntFromObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            intPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetLongFromObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            longPtr: *mut ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetObjType: ::std::option::Option<
        unsafe extern "C" fn(typeName: *const ::std::os::raw::c_char)
            -> *const Tcl_ObjType,
    >,
    pub tcl_GetStringFromObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            lengthPtr: *mut ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_InvalidateStringRep:
        ::std::option::Option<unsafe extern "C" fn(objPtr: *mut Tcl_Obj)>,
    pub tcl_ListObjAppendList: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            listPtr: *mut Tcl_Obj,
            elemListPtr: *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ListObjAppendElement: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            listPtr: *mut Tcl_Obj,
            objPtr: *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ListObjGetElements: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            listPtr: *mut Tcl_Obj,
            objcPtr: *mut ::std::os::raw::c_int,
            objvPtr: *mut *mut *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ListObjIndex: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            listPtr: *mut Tcl_Obj,
            index: ::std::os::raw::c_int,
            objPtrPtr: *mut *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ListObjLength: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            listPtr: *mut Tcl_Obj,
            lengthPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ListObjReplace: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            listPtr: *mut Tcl_Obj,
            first: ::std::os::raw::c_int,
            count: ::std::os::raw::c_int,
            objc: ::std::os::raw::c_int,
            objv: *const *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_NewBooleanObj: ::std::option::Option<
        unsafe extern "C" fn(boolValue: ::std::os::raw::c_int) -> *mut Tcl_Obj,
    >,
    pub tcl_NewByteArrayObj: ::std::option::Option<
        unsafe extern "C" fn(
            bytes: *const ::std::os::raw::c_uchar,
            length: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_NewDoubleObj: ::std::option::Option<
        unsafe extern "C" fn(doubleValue: f64) -> *mut Tcl_Obj,
    >,
    pub tcl_NewIntObj: ::std::option::Option<
        unsafe extern "C" fn(intValue: ::std::os::raw::c_int) -> *mut Tcl_Obj,
    >,
    pub tcl_NewListObj: ::std::option::Option<
        unsafe extern "C" fn(
            objc: ::std::os::raw::c_int,
            objv: *const *mut Tcl_Obj,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_NewLongObj: ::std::option::Option<
        unsafe extern "C" fn(longValue: ::std::os::raw::c_long) -> *mut Tcl_Obj,
    >,
    pub tcl_NewObj:
        ::std::option::Option<unsafe extern "C" fn() -> *mut Tcl_Obj>,
    pub tcl_NewStringObj: ::std::option::Option<
        unsafe extern "C" fn(
            bytes: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_SetBooleanObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            boolValue: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_SetByteArrayLength: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            length: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_uchar,
    >,
    pub tcl_SetByteArrayObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            bytes: *const ::std::os::raw::c_uchar,
            length: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_SetDoubleObj: ::std::option::Option<
        unsafe extern "C" fn(objPtr: *mut Tcl_Obj, doubleValue: f64),
    >,
    pub tcl_SetIntObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            intValue: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_SetListObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            objc: ::std::os::raw::c_int,
            objv: *const *mut Tcl_Obj,
        ),
    >,
    pub tcl_SetLongObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            longValue: ::std::os::raw::c_long,
        ),
    >,
    pub tcl_SetObjLength: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            length: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_SetStringObj: ::std::option::Option<
        unsafe extern "C" fn(
            objPtr: *mut Tcl_Obj,
            bytes: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_AddErrorInfo: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            message: *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_AddObjErrorInfo: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            message: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_AllowExceptions:
        ::std::option::Option<unsafe extern "C" fn(interp: *mut Tcl_Interp)>,
    pub tcl_AppendElement: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            element: *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_AppendResult: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, ...),
    >,
    pub tcl_AsyncCreate: ::std::option::Option<
        unsafe extern "C" fn(proc_: Tcl_AsyncProc, clientData: ClientData)
            -> Tcl_AsyncHandler,
    >,
    pub tcl_AsyncDelete:
        ::std::option::Option<unsafe extern "C" fn(async_: Tcl_AsyncHandler)>,
    pub tcl_AsyncInvoke: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            code: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_AsyncMark:
        ::std::option::Option<unsafe extern "C" fn(async_: Tcl_AsyncHandler)>,
    pub tcl_AsyncReady:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub tcl_BackgroundError:
        ::std::option::Option<unsafe extern "C" fn(interp: *mut Tcl_Interp)>,
    pub tcl_Backslash: ::std::option::Option<
        unsafe extern "C" fn(
            src: *const ::std::os::raw::c_char,
            readPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_char,
    >,
    pub tcl_BadChannelOption: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            optionName: *const ::std::os::raw::c_char,
            optionList: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_CallWhenDeleted: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            proc_: Tcl_InterpDeleteProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_CancelIdleCall: ::std::option::Option<
        unsafe extern "C" fn(idleProc: Tcl_IdleProc, clientData: ClientData),
    >,
    pub tcl_Close: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, chan: Tcl_Channel)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_CommandComplete: ::std::option::Option<
        unsafe extern "C" fn(cmd: *const ::std::os::raw::c_char)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_Concat: ::std::option::Option<
        unsafe extern "C" fn(
            argc: ::std::os::raw::c_int,
            argv: *const *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_ConvertElement: ::std::option::Option<
        unsafe extern "C" fn(
            src: *const ::std::os::raw::c_char,
            dst: *mut ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ConvertCountedElement: ::std::option::Option<
        unsafe extern "C" fn(
            src: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
            dst: *mut ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_CreateAlias: ::std::option::Option<
        unsafe extern "C" fn(
            slave: *mut Tcl_Interp,
            slaveCmd: *const ::std::os::raw::c_char,
            target: *mut Tcl_Interp,
            targetCmd: *const ::std::os::raw::c_char,
            argc: ::std::os::raw::c_int,
            argv: *const *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_CreateAliasObj: ::std::option::Option<
        unsafe extern "C" fn(
            slave: *mut Tcl_Interp,
            slaveCmd: *const ::std::os::raw::c_char,
            target: *mut Tcl_Interp,
            targetCmd: *const ::std::os::raw::c_char,
            objc: ::std::os::raw::c_int,
            objv: *const *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_CreateChannel: ::std::option::Option<
        unsafe extern "C" fn(
            typePtr: *const Tcl_ChannelType,
            chanName: *const ::std::os::raw::c_char,
            instanceData: ClientData,
            mask: ::std::os::raw::c_int,
        ) -> Tcl_Channel,
    >,
    pub tcl_CreateChannelHandler: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            mask: ::std::os::raw::c_int,
            proc_: Tcl_ChannelProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_CreateCloseHandler: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            proc_: Tcl_CloseProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_CreateCommand: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmdName: *const ::std::os::raw::c_char,
            proc_: Tcl_CmdProc,
            clientData: ClientData,
            deleteProc: Tcl_CmdDeleteProc,
        ) -> Tcl_Command,
    >,
    pub tcl_CreateEventSource: ::std::option::Option<
        unsafe extern "C" fn(
            setupProc: Tcl_EventSetupProc,
            checkProc: Tcl_EventCheckProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_CreateExitHandler: ::std::option::Option<
        unsafe extern "C" fn(proc_: Tcl_ExitProc, clientData: ClientData),
    >,
    pub tcl_CreateInterp:
        ::std::option::Option<unsafe extern "C" fn() -> *mut Tcl_Interp>,
    pub tcl_CreateMathFunc: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            name: *const ::std::os::raw::c_char,
            numArgs: ::std::os::raw::c_int,
            argTypes: *mut Tcl_ValueType,
            proc_: Tcl_MathProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_CreateObjCommand: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmdName: *const ::std::os::raw::c_char,
            proc_: Tcl_ObjCmdProc,
            clientData: ClientData,
            deleteProc: Tcl_CmdDeleteProc,
        ) -> Tcl_Command,
    >,
    pub tcl_CreateSlave: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            slaveName: *const ::std::os::raw::c_char,
            isSafe: ::std::os::raw::c_int,
        ) -> *mut Tcl_Interp,
    >,
    pub tcl_CreateTimerHandler: ::std::option::Option<
        unsafe extern "C" fn(
            milliseconds: ::std::os::raw::c_int,
            proc_: Tcl_TimerProc,
            clientData: ClientData,
        ) -> Tcl_TimerToken,
    >,
    pub tcl_CreateTrace: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            level: ::std::os::raw::c_int,
            proc_: Tcl_CmdTraceProc,
            clientData: ClientData,
        ) -> Tcl_Trace,
    >,
    pub tcl_DeleteAssocData: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            name: *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_DeleteChannelHandler: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            proc_: Tcl_ChannelProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_DeleteCloseHandler: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            proc_: Tcl_CloseProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_DeleteCommand: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmdName: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_DeleteCommandFromToken: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, command: Tcl_Command)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_DeleteEvents: ::std::option::Option<
        unsafe extern "C" fn(
            proc_: Tcl_EventDeleteProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_DeleteEventSource: ::std::option::Option<
        unsafe extern "C" fn(
            setupProc: Tcl_EventSetupProc,
            checkProc: Tcl_EventCheckProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_DeleteExitHandler: ::std::option::Option<
        unsafe extern "C" fn(proc_: Tcl_ExitProc, clientData: ClientData),
    >,
    pub tcl_DeleteHashEntry: ::std::option::Option<
        unsafe extern "C" fn(entryPtr: *mut Tcl_HashEntry),
    >,
    pub tcl_DeleteHashTable: ::std::option::Option<
        unsafe extern "C" fn(tablePtr: *mut Tcl_HashTable),
    >,
    pub tcl_DeleteInterp:
        ::std::option::Option<unsafe extern "C" fn(interp: *mut Tcl_Interp)>,
    pub tcl_DetachPids: ::std::option::Option<
        unsafe extern "C" fn(
            numPids: ::std::os::raw::c_int,
            pidPtr: *mut Tcl_Pid,
        ),
    >,
    pub tcl_DeleteTimerHandler:
        ::std::option::Option<unsafe extern "C" fn(token: Tcl_TimerToken)>,
    pub tcl_DeleteTrace: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, trace: Tcl_Trace),
    >,
    pub tcl_DontCallWhenDeleted: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            proc_: Tcl_InterpDeleteProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_DoOneEvent: ::std::option::Option<
        unsafe extern "C" fn(flags: ::std::os::raw::c_int)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_DoWhenIdle: ::std::option::Option<
        unsafe extern "C" fn(proc_: Tcl_IdleProc, clientData: ClientData),
    >,
    pub tcl_DStringAppend: ::std::option::Option<
        unsafe extern "C" fn(
            dsPtr: *mut Tcl_DString,
            bytes: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_DStringAppendElement: ::std::option::Option<
        unsafe extern "C" fn(
            dsPtr: *mut Tcl_DString,
            element: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_DStringEndSublist:
        ::std::option::Option<unsafe extern "C" fn(dsPtr: *mut Tcl_DString)>,
    pub tcl_DStringFree:
        ::std::option::Option<unsafe extern "C" fn(dsPtr: *mut Tcl_DString)>,
    pub tcl_DStringGetResult: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, dsPtr: *mut Tcl_DString),
    >,
    pub tcl_DStringInit:
        ::std::option::Option<unsafe extern "C" fn(dsPtr: *mut Tcl_DString)>,
    pub tcl_DStringResult: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, dsPtr: *mut Tcl_DString),
    >,
    pub tcl_DStringSetLength: ::std::option::Option<
        unsafe extern "C" fn(
            dsPtr: *mut Tcl_DString,
            length: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_DStringStartSublist:
        ::std::option::Option<unsafe extern "C" fn(dsPtr: *mut Tcl_DString)>,
    pub tcl_Eof: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ::std::os::raw::c_int,
    >,
    pub tcl_ErrnoId: ::std::option::Option<
        unsafe extern "C" fn() -> *const ::std::os::raw::c_char,
    >,
    pub tcl_ErrnoMsg: ::std::option::Option<
        unsafe extern "C" fn(err: ::std::os::raw::c_int)
            -> *const ::std::os::raw::c_char,
    >,
    pub tcl_Eval: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            script: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_EvalFile: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            fileName: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_EvalObj: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, objPtr: *mut Tcl_Obj)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_EventuallyFree: ::std::option::Option<
        unsafe extern "C" fn(clientData: ClientData, freeProc: Tcl_FreeProc),
    >,
    pub tcl_Exit: ::std::option::Option<
        unsafe extern "C" fn(status: ::std::os::raw::c_int),
    >,
    pub tcl_ExposeCommand: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            hiddenCmdToken: *const ::std::os::raw::c_char,
            cmdName: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprBoolean: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            expr: *const ::std::os::raw::c_char,
            ptr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprBooleanObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            ptr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprDouble: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            expr: *const ::std::os::raw::c_char,
            ptr: *mut f64,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprDoubleObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            ptr: *mut f64,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprLong: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            expr: *const ::std::os::raw::c_char,
            ptr: *mut ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprLongObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            ptr: *mut ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objPtr: *mut Tcl_Obj,
            resultPtrPtr: *mut *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ExprString: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            expr: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_Finalize: ::std::option::Option<unsafe extern "C" fn()>,
    pub tcl_FindExecutable: ::std::option::Option<
        unsafe extern "C" fn(argv0: *const ::std::os::raw::c_char),
    >,
    pub tcl_FirstHashEntry: ::std::option::Option<
        unsafe extern "C" fn(
            tablePtr: *mut Tcl_HashTable,
            searchPtr: *mut Tcl_HashSearch,
        ) -> *mut Tcl_HashEntry,
    >,
    pub tcl_Flush: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ::std::os::raw::c_int,
    >,
    pub tcl_FreeResult:
        ::std::option::Option<unsafe extern "C" fn(interp: *mut Tcl_Interp)>,
    pub tcl_GetAlias: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            slaveCmd: *const ::std::os::raw::c_char,
            targetInterpPtr: *mut *mut Tcl_Interp,
            targetCmdPtr: *mut *const ::std::os::raw::c_char,
            argcPtr: *mut ::std::os::raw::c_int,
            argvPtr: *mut *mut *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetAliasObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            slaveCmd: *const ::std::os::raw::c_char,
            targetInterpPtr: *mut *mut Tcl_Interp,
            targetCmdPtr: *mut *const ::std::os::raw::c_char,
            objcPtr: *mut ::std::os::raw::c_int,
            objv: *mut *mut *mut Tcl_Obj,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetAssocData: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            name: *const ::std::os::raw::c_char,
            procPtr: *mut Tcl_InterpDeleteProc,
        ) -> ClientData,
    >,
    pub tcl_GetChannel: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            chanName: *const ::std::os::raw::c_char,
            modePtr: *mut ::std::os::raw::c_int,
        ) -> Tcl_Channel,
    >,
    pub tcl_GetChannelBufferSize: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetChannelHandle: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            direction: ::std::os::raw::c_int,
            handlePtr: *mut ClientData,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetChannelInstanceData: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ClientData,
    >,
    pub tcl_GetChannelMode: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetChannelName: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel)
            -> *const ::std::os::raw::c_char,
    >,
    pub tcl_GetChannelOption: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            chan: Tcl_Channel,
            optionName: *const ::std::os::raw::c_char,
            dsPtr: *mut Tcl_DString,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetChannelType: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> *const Tcl_ChannelType,
    >,
    pub tcl_GetCommandInfo: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmdName: *const ::std::os::raw::c_char,
            infoPtr: *mut Tcl_CmdInfo,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetCommandName: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, command: Tcl_Command)
            -> *const ::std::os::raw::c_char,
    >,
    pub tcl_GetErrno:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub tcl_GetHostName: ::std::option::Option<
        unsafe extern "C" fn() -> *const ::std::os::raw::c_char,
    >,
    pub tcl_GetInterpPath: ::std::option::Option<
        unsafe extern "C" fn(
            askInterp: *mut Tcl_Interp,
            slaveInterp: *mut Tcl_Interp,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetMaster: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp) -> *mut Tcl_Interp,
    >,
    pub tcl_GetNameOfExecutable: ::std::option::Option<
        unsafe extern "C" fn() -> *const ::std::os::raw::c_char,
    >,
    pub tcl_GetObjResult: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp) -> *mut Tcl_Obj,
    >,
    pub tcl_GetOpenFile: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            chanID: *const ::std::os::raw::c_char,
            forWriting: ::std::os::raw::c_int,
            checkUsage: ::std::os::raw::c_int,
            filePtr: *mut ClientData,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GetPathType: ::std::option::Option<
        unsafe extern "C" fn(path: *const ::std::os::raw::c_char)
            -> Tcl_PathType,
    >,
    pub tcl_Gets: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel, dsPtr: *mut Tcl_DString)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_GetsObj: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel, objPtr: *mut Tcl_Obj)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_GetServiceMode:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub tcl_GetSlave: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            slaveName: *const ::std::os::raw::c_char,
        ) -> *mut Tcl_Interp,
    >,
    pub tcl_GetStdChannel: ::std::option::Option<
        unsafe extern "C" fn(type_: ::std::os::raw::c_int) -> Tcl_Channel,
    >,
    pub tcl_GetStringResult: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp)
            -> *const ::std::os::raw::c_char,
    >,
    pub tcl_GetVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub tcl_GetVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1: *const ::std::os::raw::c_char,
            part2: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub tcl_GlobalEval: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            command: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_GlobalEvalObj: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, objPtr: *mut Tcl_Obj)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_HideCommand: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmdName: *const ::std::os::raw::c_char,
            hiddenCmdToken: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_Init: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int,
    >,
    pub tcl_InitHashTable: ::std::option::Option<
        unsafe extern "C" fn(
            tablePtr: *mut Tcl_HashTable,
            keyType: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_InputBlocked: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ::std::os::raw::c_int,
    >,
    pub tcl_InputBuffered: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ::std::os::raw::c_int,
    >,
    pub tcl_InterpDeleted: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int,
    >,
    pub tcl_IsSafe: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int,
    >,
    pub tcl_JoinPath: ::std::option::Option<
        unsafe extern "C" fn(
            argc: ::std::os::raw::c_int,
            argv: *const *const ::std::os::raw::c_char,
            resultPtr: *mut Tcl_DString,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_LinkVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
            addr: *mut ::std::os::raw::c_char,
            type_: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub reserved188: ::std::option::Option<unsafe extern "C" fn()>,
    pub tcl_MakeFileChannel: ::std::option::Option<
        unsafe extern "C" fn(handle: ClientData, mode: ::std::os::raw::c_int)
            -> Tcl_Channel,
    >,
    pub tcl_MakeSafe: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp) -> ::std::os::raw::c_int,
    >,
    pub tcl_MakeTcpClientChannel: ::std::option::Option<
        unsafe extern "C" fn(tcpSocket: ClientData) -> Tcl_Channel,
    >,
    pub tcl_Merge: ::std::option::Option<
        unsafe extern "C" fn(
            argc: ::std::os::raw::c_int,
            argv: *const *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_NextHashEntry: ::std::option::Option<
        unsafe extern "C" fn(searchPtr: *mut Tcl_HashSearch)
            -> *mut Tcl_HashEntry,
    >,
    pub tcl_NotifyChannel: ::std::option::Option<
        unsafe extern "C" fn(channel: Tcl_Channel, mask: ::std::os::raw::c_int),
    >,
    pub tcl_ObjGetVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1Ptr: *mut Tcl_Obj,
            part2Ptr: *mut Tcl_Obj,
            flags: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_ObjSetVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1Ptr: *mut Tcl_Obj,
            part2Ptr: *mut Tcl_Obj,
            newValuePtr: *mut Tcl_Obj,
            flags: ::std::os::raw::c_int,
        ) -> *mut Tcl_Obj,
    >,
    pub tcl_OpenCommandChannel: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            argc: ::std::os::raw::c_int,
            argv: *mut *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> Tcl_Channel,
    >,
    pub tcl_OpenFileChannel: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            fileName: *const ::std::os::raw::c_char,
            modeString: *const ::std::os::raw::c_char,
            permissions: ::std::os::raw::c_int,
        ) -> Tcl_Channel,
    >,
    pub tcl_OpenTcpClient: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            port: ::std::os::raw::c_int,
            address: *const ::std::os::raw::c_char,
            myaddr: *const ::std::os::raw::c_char,
            myport: ::std::os::raw::c_int,
            async_: ::std::os::raw::c_int,
        ) -> Tcl_Channel,
    >,
    pub tcl_OpenTcpServer: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            port: ::std::os::raw::c_int,
            host: *const ::std::os::raw::c_char,
            acceptProc: Tcl_TcpAcceptProc,
            callbackData: ClientData,
        ) -> Tcl_Channel,
    >,
    pub tcl_Preserve:
        ::std::option::Option<unsafe extern "C" fn(data: ClientData)>,
    pub tcl_PrintDouble: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            value: f64,
            dst: *mut ::std::os::raw::c_char,
        ),
    >,
    pub tcl_PutEnv: ::std::option::Option<
        unsafe extern "C" fn(assignment: *const ::std::os::raw::c_char)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_PosixError: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp)
            -> *const ::std::os::raw::c_char,
    >,
    pub tcl_QueueEvent: ::std::option::Option<
        unsafe extern "C" fn(
            evPtr: *mut Tcl_Event,
            position: Tcl_QueuePosition,
        ),
    >,
    pub tcl_Read: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            bufPtr: *mut ::std::os::raw::c_char,
            toRead: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ReapDetachedProcs: ::std::option::Option<unsafe extern "C" fn()>,
    pub tcl_RecordAndEval: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmd: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_RecordAndEvalObj: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmdPtr: *mut Tcl_Obj,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_RegisterChannel: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, chan: Tcl_Channel),
    >,
    pub tcl_RegisterObjType: ::std::option::Option<
        unsafe extern "C" fn(typePtr: *const Tcl_ObjType),
    >,
    pub tcl_RegExpCompile: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            pattern: *const ::std::os::raw::c_char,
        ) -> Tcl_RegExp,
    >,
    pub tcl_RegExpExec: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            regexp: Tcl_RegExp,
            text: *const ::std::os::raw::c_char,
            start: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_RegExpMatch: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            text: *const ::std::os::raw::c_char,
            pattern: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_RegExpRange: ::std::option::Option<
        unsafe extern "C" fn(
            regexp: Tcl_RegExp,
            index: ::std::os::raw::c_int,
            startPtr: *mut *const ::std::os::raw::c_char,
            endPtr: *mut *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_Release:
        ::std::option::Option<unsafe extern "C" fn(clientData: ClientData)>,
    pub tcl_ResetResult:
        ::std::option::Option<unsafe extern "C" fn(interp: *mut Tcl_Interp)>,
    pub tcl_ScanElement: ::std::option::Option<
        unsafe extern "C" fn(
            src: *const ::std::os::raw::c_char,
            flagPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ScanCountedElement: ::std::option::Option<
        unsafe extern "C" fn(
            src: *const ::std::os::raw::c_char,
            length: ::std::os::raw::c_int,
            flagPtr: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_SeekOld: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            offset: ::std::os::raw::c_int,
            mode: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_ServiceAll:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub tcl_ServiceEvent: ::std::option::Option<
        unsafe extern "C" fn(flags: ::std::os::raw::c_int)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_SetAssocData: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            name: *const ::std::os::raw::c_char,
            proc_: Tcl_InterpDeleteProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_SetChannelBufferSize: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel, sz: ::std::os::raw::c_int),
    >,
    pub tcl_SetChannelOption: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            chan: Tcl_Channel,
            optionName: *const ::std::os::raw::c_char,
            newValue: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_SetCommandInfo: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            cmdName: *const ::std::os::raw::c_char,
            infoPtr: *const Tcl_CmdInfo,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_SetErrno:
        ::std::option::Option<unsafe extern "C" fn(err: ::std::os::raw::c_int)>,
    pub tcl_SetErrorCode: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, ...),
    >,
    pub tcl_SetMaxBlockTime:
        ::std::option::Option<unsafe extern "C" fn(timePtr: *const Tcl_Time)>,
    pub tcl_SetPanicProc:
        ::std::option::Option<unsafe extern "C" fn(panicProc: Tcl_PanicProc)>,
    pub tcl_SetRecursionLimit: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            depth: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_SetResult: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            result: *mut ::std::os::raw::c_char,
            freeProc: Tcl_FreeProc,
        ),
    >,
    pub tcl_SetServiceMode: ::std::option::Option<
        unsafe extern "C" fn(mode: ::std::os::raw::c_int)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_SetObjErrorCode: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            errorObjPtr: *mut Tcl_Obj,
        ),
    >,
    pub tcl_SetObjResult: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            resultObjPtr: *mut Tcl_Obj,
        ),
    >,
    pub tcl_SetStdChannel: ::std::option::Option<
        unsafe extern "C" fn(
            channel: Tcl_Channel,
            type_: ::std::os::raw::c_int,
        ),
    >,
    pub tcl_SetVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
            newValue: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub tcl_SetVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1: *const ::std::os::raw::c_char,
            part2: *const ::std::os::raw::c_char,
            newValue: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub tcl_SignalId: ::std::option::Option<
        unsafe extern "C" fn(sig: ::std::os::raw::c_int)
            -> *const ::std::os::raw::c_char,
    >,
    pub tcl_SignalMsg: ::std::option::Option<
        unsafe extern "C" fn(sig: ::std::os::raw::c_int)
            -> *const ::std::os::raw::c_char,
    >,
    pub tcl_SourceRCFile:
        ::std::option::Option<unsafe extern "C" fn(interp: *mut Tcl_Interp)>,
    pub tcl_SplitList: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            listStr: *const ::std::os::raw::c_char,
            argcPtr: *mut ::std::os::raw::c_int,
            argvPtr: *mut *mut *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_SplitPath: ::std::option::Option<
        unsafe extern "C" fn(
            path: *const ::std::os::raw::c_char,
            argcPtr: *mut ::std::os::raw::c_int,
            argvPtr: *mut *mut *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_StaticPackage: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            pkgName: *const ::std::os::raw::c_char,
            initProc: Tcl_PackageInitProc,
            safeInitProc: Tcl_PackageInitProc,
        ),
    >,
    pub tcl_StringMatch: ::std::option::Option<
        unsafe extern "C" fn(
            str: *const ::std::os::raw::c_char,
            pattern: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_TellOld: ::std::option::Option<
        unsafe extern "C" fn(chan: Tcl_Channel) -> ::std::os::raw::c_int,
    >,
    pub tcl_TraceVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
            proc_: Tcl_VarTraceProc,
            clientData: ClientData,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_TraceVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1: *const ::std::os::raw::c_char,
            part2: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
            proc_: Tcl_VarTraceProc,
            clientData: ClientData,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_TranslateFileName: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            name: *const ::std::os::raw::c_char,
            bufferPtr: *mut Tcl_DString,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub tcl_Ungets: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            str: *const ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
            atHead: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_UnlinkVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_UnregisterChannel: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, chan: Tcl_Channel)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_UnsetVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_UnsetVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1: *const ::std::os::raw::c_char,
            part2: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_UntraceVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
            proc_: Tcl_VarTraceProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_UntraceVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1: *const ::std::os::raw::c_char,
            part2: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
            proc_: Tcl_VarTraceProc,
            clientData: ClientData,
        ),
    >,
    pub tcl_UpdateLinkedVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_UpVar: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            frameName: *const ::std::os::raw::c_char,
            varName: *const ::std::os::raw::c_char,
            localName: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_UpVar2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            frameName: *const ::std::os::raw::c_char,
            part1: *const ::std::os::raw::c_char,
            part2: *const ::std::os::raw::c_char,
            localName: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_VarEval: ::std::option::Option<
        unsafe extern "C" fn(interp: *mut Tcl_Interp, ...)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_VarTraceInfo: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            varName: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
            procPtr: Tcl_VarTraceProc,
            prevClientData: ClientData,
        ) -> ClientData,
    >,
    pub tcl_VarTraceInfo2: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            part1: *const ::std::os::raw::c_char,
            part2: *const ::std::os::raw::c_char,
            flags: ::std::os::raw::c_int,
            procPtr: Tcl_VarTraceProc,
            prevClientData: ClientData,
        ) -> ClientData,
    >,
    pub tcl_Write: ::std::option::Option<
        unsafe extern "C" fn(
            chan: Tcl_Channel,
            s: *const ::std::os::raw::c_char,
            slen: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tcl_WrongNumArgs: ::std::option::Option<
        unsafe extern "C" fn(
            interp: *mut Tcl_Interp,
            objc: ::std::os::raw::c_int,
            objv: *const *mut Tcl_Obj,
            message: *const ::std::os::raw::c_char,
        ),
    >,
    pub tcl_DumpActiveMemory: ::std::option::Option<
        unsafe extern "C" fn(fileName: *const ::std::os::raw::c_char)
            -> ::std::os::raw::c_int,
    >,
    pub tcl_ValidateAllMemory: ::std::option::Option<
        unsafe extern "C" fn(
            file: *const ::std::os::raw::c_char,
            line: ::std::os::raw::c_int,
        ),
    >,
